[
  {
    "id": 1,
    "name": "Dashboard Sistem Informasi Wholesale",
    "category": "Full-stack Development",
    "description": {
      "indonesia": "Sistem Informasi Pengelolaan Pelanggan Data Teknis Pelanggan Wholesale Berbasis Web ini dibangun dalam rangka memenuhi tugas kerja praktek di PT Telkom Indonesia Graha Merah Putih Bandung, dibangun menggunakan bahasa Pemrograman PHP dengan framework Laravel.",
      "english": "A Web-Based Wholesale Customer Technical Data Management Information System built in order to fulfill internship assignments at PT Telkom Indonesia Graha Merah Putih Bandung, built using the PHP Programming language with the Laravel framework."
    },
    "technology": [
      "HTML",
      "CSS",
      "JavaScript",
      "Bootstrap CSS",
      "PHP",
      "Laravel",
      "MySQL",
      "Git"
    ],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Front-end Developer, Back-end Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      },
      {
        "name": "Raden Fachrul Ramzy Muhammad",
        "role": "Front-end Developer, Back-end Developer",
        "profile": "https://www.linkedin.com/in/raden-fachrul-605a12341/",
        "avatar": "/image/avatar/raden-fachrul.jpeg"
      },
      {
        "name": "Robi Nurhidayat",
        "role": "Back-end Developer, Front-end Developer",
        "profile": "https://www.linkedin.com/in/robi-nurhidayat-2a857224a/",
        "avatar": "/image/avatar/robi-nurhidayat.jpeg"
      }
    ],
    "source": "https://github.com/bagusperdanay7/kerja-praktek",
    "url": "",
    "thumbnail": {
      "src": "/image/projects/telkom-intership/dashboard-home.png",
      "caption": "Preview of Dashboard Rekap Deployment Home Page",
      "original": true
    },
    "previews": [
      {
        "preview": "/image/projects/telkom-intership/dashboard-home.png",
        "caption": "Preview of Dashboard Rekap Deployment Home Page"
      }
    ],
    "details": {
      "about": {
        "indonesia": [
          "Sistem Informasi Pengelolaan Pelanggan Data Teknis Pelanggan Wholesale Berbasis Web adalah aplikasi hasil Kerja Praktek atau magang di Perusahaan PT Telkom Indonesia Graha Merah Putih, Kota Bandung, Jawa Barat, Indonesia. Kami membuat aplikasi di dalam divisi Managed Service Operation (MSO). Divisi ini melayani pemesanan penyediaan infrastruktur untuk pelanggan Wholesale, yaitu Telkomsel & Other Licensed Operator (OLO). Aplikasi ini memiliki 3 jenis pengguna, yaitu admin, editor, dan user view. Pengerjaan program dimulai dari tanggal 1 September 2021 dan selesai pada 18 Desember 2021 yang berarti pengerjaannya berdurasi 3 bulan 18 hari. Sistem kerja yang dilakukan adalah Hibrida, yaitu setiap Senin kami bekerja dari kantor (Work From Office), dan Selasa - Jum'at kami bekerja dari rumah (Work from Home).",
          "Fitur-fitur aplikasi web yang tersedia antara lain, autentikasi login berbasis peran (administrator, editor, & user view), operasi Create, Read, Update, & Delete (CRUD), impor berkas dari Excel ke dalam bentuk basis data ekspor berkas dari basis data menjadi berkas Excel, penyaringan data berdasarkan kriteria tertentu, dan pengelolaan data pengguna (khusus administrator)"
        ],
        "english": [
          "Web-based Wholesale Customer Technical Data Management Information System is an application based on an internship at PT Telkom Indonesia Graha Merah Putih, Bandung City, West Java, Indonesia. We built the application in the Managed Service Operation (MSO) division. This division serves ordering infrastructure provision for wholesale customers, namely Telkomsel & Other Licensed Operator (OLO). This application caters to three distinct user types: admin, editor, and user view. The program work started on September 1, 2021, and ended on December 18, 2021, meaning that the work took 3 months and 18 days. The work system conducted was hybrid, i.e., every Monday we worked from office, and Tuesday through Friday we worked from home.",
          "The web application's features include role-based login authentication (administrator, editor, and user view), CRUD (create, read, update, and delete) operations, Excel file import and export, data filtering according to specific criteria, and administrator-only user data management."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Bootstrap CSS",
            "url": "https://getbootstrap.com",
            "version": "4.0+",
            "usage": "Kerangka kerja CSS untuk mempercepat implementasi Antarmuka pengguna"
          },
          {
            "name": "Composer",
            "url": "https://getcomposer.org",
            "version": "2.20+",
            "usage": "Pengelola dependensi"
          },
          {
            "name": "DataTables",
            "url": "https://datatables.net",
            "version": "1.11+",
            "usage": "Membuat table menjadi interaktif"
          },
          {
            "name": "PHP",
            "url": "https://www.php.net",
            "version": "7.4.20+",
            "usage": "Bahasa pemrograman utama"
          },
          {
            "name": "Laravel",
            "url": "https://laravel.com/",
            "version": "8.54+",
            "usage": "Kerangka PHP untuk mempercepat pengembangan aplikasi"
          },
          {
            "name": "Line Awesome",
            "url": "https://icons8.com/line-awesome",
            "version": "1.0.2+",
            "usage": "Icon pack untuk situs web"
          },
          {
            "name": "Sweet Alert",
            "url": "https://sweetalert2.github.io",
            "version": "2.0+",
            "usage": "Membuat pesan alert lebih cantik"
          },
          {
            "name": "Visual Studio Code",
            "url": "https://code.visualstudio.com/",
            "version": "Latest",
            "usage": "Penyunting kode"
          },
          {
            "name": "MySQL",
            "url": "https://www.mysql.com/",
            "version": "8.0+",
            "usage": "Database Management System (DBMS)"
          },
          {
            "name": "XAMPP (Apache, MySQL, PHP)",
            "url": "https://www.apachefriends.org/download.html",
            "version": "7.4+",
            "usage": "Peladen web lokal"
          },
          {
            "name": "Balsamiq Cloud",
            "url": "https://balsamiq.com/",
            "version": "-",
            "usage": "Perancangan kerangka dasar antarmuka pengguna"
          },
          {
            "name": "Draw.io",
            "url": "https://app.diagrams.net/",
            "version": "-",
            "usage": "Pembuatan Entity Relational Diagram (ERD)"
          }
        ],
        "english": [
          {
            "name": "Bootstrap CSS",
            "url": "https://getbootstrap.com",
            "version": "4.0+",
            "usage": "CSS framework to accelerate implementation User interface"
          },
          {
            "name": "Composer",
            "url": "https://getcomposer.org",
            "version": "2.20+",
            "usage": "Dependency manager"
          },
          {
            "name": "DataTables",
            "url": "https://datatables.net",
            "version": "1.11+",
            "usage": "Make the table interactive"
          },
          {
            "name": "PHP",
            "url": "https://www.php.net",
            "version": "7.4.20+",
            "usage": "Main programming language"
          },
          {
            "name": "Laravel",
            "url": "https://laravel.com/",
            "version": "8.54+",
            "usage": "PHP framework to accelerate application development"
          },
          {
            "name": "Line Awesome",
            "url": "https://icons8.com/line-awesome",
            "version": "1.0.2+",
            "usage": "The icon pack for website"
          },
          {
            "name": "Sweet Alert",
            "url": "https://sweetalert2.github.io",
            "version": "2.0+",
            "usage": "Make alert messages more beautiful"
          },
          {
            "name": "Visual Studio Code",
            "url": "https://code.visualstudio.com/",
            "version": "Latest",
            "usage": "Code editor"
          },
          {
            "name": "MySQL",
            "url": "https://www.mysql.com/",
            "version": "8.0+",
            "usage": "Database Management System (DBMS)"
          },
          {
            "name": "XAMPP (Apache, MySQL, PHP)",
            "url": "https://www.apachefriends.org/download.html",
            "version": "7.4+",
            "usage": "Local web server"
          },
          {
            "name": "Balsamiq Cloud",
            "url": "https://balsamiq.com/",
            "version": "-",
            "usage": "Design the wireframe for user interface"
          },
          {
            "name": "Draw.io",
            "url": "https://app.diagrams.net/",
            "version": "-",
            "usage": "Entity Relational Diagram (ERD) Creation"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Bekerja sama dengan sebuah tim beranggotakan 3 orang dalam membangun website Sistem Informasi Manajemen Data yang membantu memudahkan pegawai dalam proses pengelolaan data teknis pelanggan menggunakan HTML, CSS, JavaScript dan PHP Laravel dalam tim.",
              "Merancang perangkat lunak yang sesuai dengan kebutuhan perusahaan dan melaporkan hasil pengerjaan perangkat lunak yang sedang dibangun setiap minggu.",
              "Melakukan operasi Create, Read, Update, dan Delete (CRUD) pada halaman progress lapangan dan membantu membuat autentikasi pengguna.",
              "Membuat fitur penyaringan data (filter) berdasarkan kriteria yang ditentukan pada halaman deployment, progress lapangan, disconnect",
              "Menerjemahkan rancangan kerangka dasar (wireframe) menjadi kode program untuk menghasilkan tampilan antarmuka pengguna aplikasi situs web dan membuat fitur mini penunjuk jam real-time dengan JavaScript.",
              "Membuat konsep desain awal aplikasi web melalui wireframe menggunakan Balsamiq Cloud"
            ],
            "english": [
              "Worked collaboratively with a team of 3 people in building a Data Management Information System website that helps facilitate employees in the process of managing customer technical data by utilizing HTML, CSS, JavaScript and PHP Laravel in the team.",
              "Designed software in accordance with the needs of the company and reported the progress of the software being built weekly.",
              "Conducted Create, Read, Update, and Delete (CRUD) operations on the progres lapangan (field progress) page and help create user authentication.",
              "Created a data filtering feature based on the criteria specified on the deployment, progres lapangan (field progress), and disconnect pages.",
              "Translated the wireframe design into program code to create the website application's user interface and created a mini real-time clock function using JavaScript.",
              "Conceptualized the initial web application design through wireframes using Balsamiq Cloud."
            ]
          }
        },
        {
          "name": "Raden Fachrul Ramzy Muhammad",
          "detail": {
            "indonesia": [
              "Membangun sistem informasi berbasis website untuk mempermudah pengelolaan data teknis pelanggan dengan bekerjasama bersama rekan tim untuk merancang dan mengembangkan aplikasi bersama.",
              "Merancang perangkat lunak yang sesuai dengan kebutuhan perusahaan dan melaporkan hasil pengerjaan perangkat lunak yang sedang dibangun setiap minggu.",
              "Membuat fitur autentikasi login berbasis peran yang terdiri dari tiga peran (administrator, editor, user view) serta mendesain tampilan antarmuka pengguna untuk halaman login.",
              "Membuat fitur pengelolaan pengguna untuk administrator seperti menambahkan data pengguna, mengubah data pengguna, serta menghapus data pengguna.",
              "Menerjemahkan rancangan kerangka dasar (wireframe) menjadi kode program untuk menghasilkan tampilan antarmuka pengguna aplikasi situs web.",
              "Membuat konsep desain awal aplikasi web melalui wireframe menggunakan Balsamiq Cloud"
            ],
            "english": [
              "Built a website-based information system to facilitate the management of customer technical data by working with teammates to design and develop applications together.",
              "Designed software in accordance with the needs of the company and reported the progress of the software being built weekly.",
              "Created a role-based login authentication feature consisting of three roles (administrator, editor, user view) and designed the user interface for the login page.",
              "Created user management features for administrators, including the ability to create user data, update user data, and delete user data.",
              "Translated the wireframe design into program code to create the website application's user interface.",
              "Conceptualized the initial web application design through wireframes using Balsamiq Cloud."
            ]
          }
        },
        {
          "name": "Robi Nurhidayat",
          "detail": {
            "indonesia": [
              "Membangun sistem informasi berbasis website untuk mempermudah pengelolaan data teknis pelanggan dengan bekerjasama bersama rekan tim untuk merancang dan mengembangkan aplikasi bersama.",
              "Merancang perangkat lunak yang sesuai dengan kebutuhan perusahaan dan melaporkan hasil pengerjaan perangkat lunak yang sedang dibangun setiap minggu.",
              "Membuat fitur untuk mengekspor data ke dalam file Excel, serta mengimpor data dari file Excel ke dalam basis data.",
              "Melakukan operasi Create, Read, Update, dan Delete (CRUD) pada halaman deployment, rekap, disconnect, dan exe summ.",
              "Mengkonversi data yang ada di Excel ke dalam bentuk skema dan model database yang terstruktur untuk meminimalisir redundansi dan meningkatkan efisiensi.",
              "Menerjemahkan rancangan kerangka dasar (wireframe) menjadi kode program untuk menghasilkan tampilan antarmuka pengguna aplikasi situs web.",
              "Membuat konsep desain awal aplikasi web melalui wireframe menggunakan Balsamiq Cloud"
            ],
            "english": [
              "Built a website-based information system to facilitate the management of customer technical data by working with teammates to design and develop applications together.",
              "Designed software in accordance with the needs of the company and reported the progress of the software being built weekly.",
              "Created features to export data into an Excel file, as well as import data from an Excel file into a database.",
              "Performed Create, Read, Update, and Delete (CRUD) operations on deployment, recap, disconnect, and exe summ pages.",
              "Transformed existing data from Excel into a structured database schema and model to minimize redundancy and boost efficiency.",
              "Translated the wireframe design into program code to create the website application's user interface.",
              "Conceptualized the initial web application design through wireframes using Balsamiq Cloud."
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2021-12-18",
    "license": ""
  },
  {
    "id": 2,
    "name": "Final Project Undergraduate Thesis - ABSA with BiLSTM",
    "category": "Machine Learning",
    "description": {
      "indonesia": "Kode program dari skripsi berjudul Analisis Sentimen Berbasis Aspek Terhadap Ulasan Aplikasi Market Place Menggunakan Bidirectional Long Short-Term Memory, mengimplementasikan hasil penelitian skripsi saya dengan bahasa pemrograman Python dan bantuan library Keras dan Tensorflow dalam pembuatan model AI dengan 3000 dataset ulasan salah satu market place Indonesia diambil dari platform Google Play Store.",
      "english": "My undergraduate thesis, Aspect-Based Sentiment Analysis Towards Market Place Application Reviews Using Bidirectional Long Short-Term Memory, uses the Python programming language and the Keras and Tensorflow libraries to create AI models using 3000 review datasets of one Indonesian marketplace that were collected from Google Play Store platform."
    },
    "technology": [
      "Python",
      "Numpy",
      "Pandas",
      "Keras",
      "TensorFlow",
      "AI",
      "Scikit-learn",
      "Deep Learning",
      "NLP",
      "Sentiment Analysis"
    ],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Data Scientist",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://github.com/bagusperdanay7/SKRIPSI-Program",
    "url": "",
    "thumbnail": {
      "src": "/image/projects/absa-blstm/absa-illustration.jpg",
      "caption": "Illustration of Aspect-Based Sentiment Analysis BiLSTM Project",
      "original": false
    },
    "previews": null,
    "details": {
      "about": {
        "indonesia": [
          "Tujuan dari pengembangan dan penelitian adalah untuk memenuhi persyaratan mata kuliah Skripsi untuk memperoleh gelar Sarjana. Judul Skripsi saya adalah Analisis Sentimen Berbasis Aspek Terhadap Ulasan Aplikasi Market Place Menggunakan Bidirectional Long Short-Term Memory. Saya ucapkan terima kasih yang tidak terbatas untuk Ibu Nelly Indriani Widiastuti, S.Si., M.T. selaku pembimbing Skripsi saya, Ibu Kania Evita Dewi, S.Pd., M.Si. selaku penguji yang memberikan saran dan revisi untuk memperbaiki skripsi saya, dan Pak Angga Setiyadi, S.Kom., M.Kom., CIPTM selaku penguji kedua yang memberikan saran untuk skripsi saya. Algoritma penyematan kata menggunakan Word2Vector Continuous Bag of Words (CBOW). Aspek yang digunakan berjumlah lima, yakni aspek Layanan, Fitur, Kebermanfaatan, Bisnis, dan Non Aspek. Dan kelas labelnya terdiri dari positif, negatif, dan non sentimen.",
          "Tahapannya dimulai dari Identifikasi masalah, dilanjutkan studi literatur dan mengumpulkan kumpulan data ulasan aplikasi market place. Setelah dataset didapatkan, langkah berikutnya yaitu menganalisis data termasuk pelabelan manual. Tahapan prapemrosesan data antara lain: menyeragamkan seluruh huruf menjadi hurut kapital atau huruf kecil (case folding), penyaringan kata seperti menghapus simbol, tanda baca, angka dan emoji yang tidak terpakai (filtering), normalisasi kata yakni mengubah kata informal menjadi formal, konversi negasi, memangkas kalimat menjadi token atau kata (tokenization), dan mebuang kata umum yang jarang digunakan (stopword removal). Setelah melakukan prapemrosesan data, dilanjutkan dengan penyematan kata yaitu mengubah kata menjadi vektor. Setelah data sudah diubah menjadi vektor, lalu data siap untuk dilakukan analisis sentimen dengan metode pembelajaran mesin Bidirectional Long Short-Term Memory.",
          "Karena ini merupakan teknik pembelajaran terbimbing (supervised learning), kumpulan data perlu diberi label untuk melatih algoritma dan memprediksi hasilnya. Untuk itu, data perlu dibagi menjadi data latih dan data uji. Proses pelatihan dan pengujian algoritma dilakukan berulang kali, termasuk mengubah parameter untuk mendapatkan model yang optimal. Evaluasi model dilakukan menggunakan confusion matrix, yang mencakup akurasi, presisi, recall, dan f1-score.",
          "Dataset diperoleh dari Google Play Store ulasan mengenai salah satu aplikasi market place yang ada di Indonesia (https://www.kaggle.com/datasets/bagusperdanayusuf/marketplace-application-in-indonesia-reviews), data diambil oleh Muhamad Febrian Fauzi Al Fandi dan Bagus Perdana Yusuf menggunakan bantuan pustaka Python yaitu google-play-scraper. Terima kasih juga kepada Haryo AW telah menyusun kamus informal menjadi formal (https://github.com/haryoa/indo-collex/blob/main/dict/inforformal-formalIndonesian-dictionary.tsv) dan Muhammad Okky Ibrohim telah menyusun kamus kata gaul menjadi bahasa indonesia yang baik (https://github.com/okkyibrohim/id-multi-label-hate-speech-and-abusive-language-detection/blob/master/new_kamusalay.csv)."
        ],
        "english": [
          "The objective of the development and research is to meet the requirements of the Undergraduate Thesis subject for a Bachelor's degree. My undergraduate thesis is titled \"Aspect-Based Sentiment Analysis Towards Market Place Application Reviews Using Bidirectional Long Short-Term Memory.\" I would like to thank Mrs. Nelly Indriani Widiastuti, M.T., my undergraduate thesis supervisor; Mrs. Kania Evita Dewi, S.Pd., M.Si., the examiner who provided suggestions and revisions to improve my undergraduate thesis; and Mr. Angga Setiyadi, S.Kom., M.Kom., CIPTM, the second examiner who made suggestions for my bachelor thesis. The word embedding algorithm used Word2Vector Continuous Bag of Words (CBOW). The aspects used are five: service, features, usability, business, and non-aspect. And the label class is composed of positive, negative, and non-sentiment.",
          "The phase begins with identifying the problem, continued with a literature study and collecting a dataset of marketplace application reviews. Once the dataset is collected, the next step involves analyzing the data, which includes manual labeling. Data preprocessing phases include homogenizing all letters into uppercase or lowercase letters (case folding), filtering out irrelevant symbols, punctuation marks, numbers, and emojis (filtering), word normalization, i.e., converting informal words to formal, converting negation, trimming sentences into tokens or words (tokenization), and removing common words that are infrequently used (stopword removal). Once preprocessing is complete, the next step is word embedding, which entails converting words into vectors. After the data has been converted into vectors, then the data is ready for sentiment analysis with the Bidirectional Long Short-Term Memory machine learning method.",
          "Because this is a supervised learning technique, the dataset must be labeled before training the algorithm and predicting the results. As a result, the data must be separated into two parts: training and testing. The method is trained and tested iteratively, with the parameters changed to achieve an optimal model. A confusion matrix is used to evaluate models, which incorporates accuracy, precision, recall, and the f1-score.",
          "The dataset was collected from Google Play Store reviews of one of the marketplace applications in Indonesia (https://www.kaggle.com/datasets/bagusperdanayusuf/marketplace-application-in-indonesia-reviews); the data was collected by Muhamad Febrian Fauzi Al Fandi and Bagus Perdana Yusuf using the assistance of the Python library, google-play-scraper. Thanks also to Haryo AW for composing an informal dictionary into formal (https://github.com/haryoa/indo-collex/blob/main/dict/inforformal-formalIndonesian-dictionary.tsv) and Muhammad Okky Ibrohim for composing a dictionary of slang words into proper Indonesian (https://github.com/okkyibrohim/id-multi-label-hate-speech-and-abusive-language-detection/blob/master/new_kamusalay.csv)."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Python",
            "url": "https://www.python.org/",
            "version": "3.8+",
            "usage": "Bahasa pemrograman utama"
          },
          {
            "name": "Google Colab",
            "url": "https://colab.research.google.com/",
            "version": "Latest",
            "usage": "Layanan Jupyter Notebook daring yang disediakan oleh Google untuk mempercepat komputasi pembelajaran mesin dengan dukungan GPU"
          },
          {
            "name": "Gensim",
            "url": "https://radimrehurek.com/gensim/",
            "version": "4.2+",
            "usage": "Pustaka Python untuk mengimplementasikan Word2Vec penyematan kata"
          },
          {
            "name": "Keras",
            "url": "https://keras.io/",
            "version": "2.10+",
            "usage": "Antarmuka pemrograman aplikasi Python untuk mengimplementasikan Algoritma deep learning, Bi-LSTM"
          },
          {
            "name": "Matplotlib",
            "url": "https://matplotlib.org/",
            "version": "3.6.0+",
            "usage": "Pustaka Python untuk memvisualisasikan data secara interaktif"
          },
          {
            "name": "NLTK: Natural Language Toolkit",
            "url": "https://www.nltk.org/",
            "version": "3.8.0+",
            "usage": "Pustaka Python untuk prapemrosesan data"
          },
          {
            "name": "Numpy",
            "url": "https://numpy.org/",
            "version": "1.19+",
            "usage": "Pustaka Python untuk membantu melakukan komputasi ilmiah"
          },
          {
            "name": "Pandas",
            "url": "https://pandas.pydata.org/",
            "version": "1.4+",
            "usage": "Pustaka Python untuk membantu menganalisis dan memanipulasi data"
          },
          {
            "name": "Scikit-learn",
            "url": "https://scikit-learn.org/stable/",
            "version": "1.1+",
            "usage": "Antarmuka pemrograman aplikasi Python untuk mengimplementasikan algoritma pembelajaran mesin"
          },
          {
            "name": "Seaborn",
            "url": "https://seaborn.pydata.org/",
            "version": "0.12.0+",
            "usage": "Pustaka Python untuk memvisualisasikan data secara informatif"
          },
          {
            "name": "TensorFlow",
            "url": "https://www.tensorflow.org/",
            "version": "2.0+",
            "usage": "Platform untuk membuat pembelajaran mesin lebih kuat dan cepat"
          },
          {
            "name": "Imbalance Learn",
            "url": "https://imbalanced-learn.org/stable/",
            "version": "0.10+",
            "usage": "Pustaka untuk menangani data yang tidak seimbang dengan membuat replikasi data"
          },
          {
            "name": "Google-Play-Scraper",
            "url": "https://github.com/JoMingyu/google-play-scraper",
            "version": "1.2.0+",
            "usage": "Pustaka Python untuk mengambil data (scraping) di Google Play Store dengan cepat"
          },
          {
            "name": "Microsoft Excel",
            "url": "https://www.microsoft.com/id-id/microsoft-365/excel",
            "version": "2019",
            "usage": "Perangkat lunak untuk mengolah angka seperti perhitungan manual algoritma yang digunakan dan melihat dataset dalam bentuk tabular"
          },
          {
            "name": "Visual Studio Code",
            "url": "https://code.visualstudio.com/",
            "version": "Latest",
            "usage": "Penyunting kode"
          }
        ],
        "english": [
          {
            "name": "Python",
            "url": "https://www.python.org/",
            "version": "3.8+",
            "usage": "Main programming language"
          },
          {
            "name": "Google Colab",
            "url": "https://colab.research.google.com/",
            "version": "Latest",
            "usage": "An online Jupyter Notebook service provided by Google to accelerate machine learning computing with GPU support"
          },
          {
            "name": "Gensim",
            "url": "https://radimrehurek.com/gensim/",
            "version": "4.2+",
            "usage": "Python library for implementing Word2Vec word embedding"
          },
          {
            "name": "Keras",
            "url": "https://keras.io/",
            "version": "2.10+",
            "usage": "Python Application Programming Interface (API) to implement deep learning algorithm, Bi-LSTM"
          },
          {
            "name": "Matplotlib",
            "url": "https://matplotlib.org/",
            "version": "3.6.0+",
            "usage": "Python library for visualizing data interactively"
          },
          {
            "name": "NLTK: Natural Language Toolkit",
            "url": "https://www.nltk.org/",
            "version": "3.8.0+",
            "usage": "Python library for data preprocessing"
          },
          {
            "name": "Numpy",
            "url": "https://numpy.org/",
            "version": "1.19+",
            "usage": "Python library to help perform scientific computing"
          },
          {
            "name": "Pandas",
            "url": "https://pandas.pydata.org/",
            "version": "1.4+",
            "usage": "Python library to assist in analyzing and manipulating data"
          },
          {
            "name": "Scikit-learn",
            "url": "https://scikit-learn.org/stable/",
            "version": "1.1+",
            "usage": "Python application programming interface to implement machine learning algorithms"
          },
          {
            "name": "Seaborn",
            "url": "https://seaborn.pydata.org/",
            "version": "0.12.0+",
            "usage": "Python library to visualize data informatively"
          },
          {
            "name": "TensorFlow",
            "url": "https://www.tensorflow.org/",
            "version": "2.0+",
            "usage": "Platform to make machine learning more powerful and fast"
          },
          {
            "name": "Imbalance Learn",
            "url": "https://imbalanced-learn.org/stable/",
            "version": "0.10+",
            "usage": "Library to handle imbalanced data by creating data replication"
          },
          {
            "name": "Google-Play-Scraper",
            "url": "https://github.com/JoMingyu/google-play-scraper",
            "version": "1.2.0+",
            "usage": "Python library for quick Google Play Store data scraping"
          },
          {
            "name": "Microsoft Excel",
            "url": "https://www.microsoft.com/id-id/microsoft-365/excel",
            "version": "2019",
            "usage": "Software for numerical processing, including tabular data visualization and manual algorithm computation"
          },
          {
            "name": "Visual Studio Code",
            "url": "https://code.visualstudio.com/",
            "version": "Latest",
            "usage": "Code editor"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Melakukan analisis komprehensif dan prapemrosesan data teks dari ulasan Google Play untuk sebuah aplikasi marketplace di Indonesia.",
              "Merancang model pembelajaran mesin untuk analisis sentimen berbasis aspek pada ulasan aplikasi marketplace menggunakan metode Bidirectional Long Short-Term Memory (BiLSTM), serta melakukan evaluasi kinerja model secara komprehensif menggunakan Confustion Matrix",
              "Mengevaluasi performa berbagai algoritma pembelajaran mesin tradisional dibandingkan dengan algoritma deep learning Bidirectional Long Short-Term Memory (BiLSTM), serta menggunakan teknik penyeimbangan data SMOTE untuk analisis sentimen berbasis aspek"
            ],
            "english": [
              "Conducted comprehensive analysis and preprocessing of text data from Google Play reviews of an Indonesian marketplace app.",
              "Designed a machine learning model for aspect-based sentiment analysis on marketplace application reviews using the Bidirectional Long Short-Term Memory (BiLSTM) method and comprehensively evaluated the model's performance using a confusion matrix.",
              "Assessed the performance of various traditional machine learning algorithms in comparison to the Bidirectional Long Short-Term Memory (BiLSTM) deep learning algorithm, while utilizing the SMOTE data balancing technique for aspect-based sentiment analysis."
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2023-09-22",
    "license": ""
  },
  {
    "id": 3,
    "name": "Portofolio With Vue",
    "category": "Front-end Development",
    "description": {
      "indonesia": "Aplikasi Halaman Tunggal Situs Web Portofolio Pribadi yang menggunakan kerangka kerja Vue.js dan Tailwind CSS.",
      "english": "A Single Page Application Personal Portfolio Website utilizing the Vue.js framework and Tailwind CSS."
    },
    "technology": [
      "JavaScript",
      "Vue.js",
      "Tailwind CSS",
      "Vite",
      "Responsive Web"
    ],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Front-end Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://github.com/bagusperdanay7/portofolio-vue",
    "url": "",
    "thumbnail": {
      "src": "/image/projects/portfolio/portfolio-preview.png",
      "caption": "Preview of Portfolio Home page UI & UX design",
      "original": true
    },
    "previews": null,
    "details": {
      "about": {
        "indonesia": [
          "Proyek ini adalah situs web portofolio pribadi saya yang dikembangkan menggunakan kerangka kerja Vue.js + Vite dan kerangka kerja Tailwind CSS dengan menerapkan aplikasi halaman tunggal menggunakan vue router. Tipografi yang digunakan adalah Lato dari Google Fonts & Ikon yang dipakai di dalam situs web ini adalah Boxicons. Tujuan pembuatan situs web ini adalah untuk memperkenalkan citra pribadi saya, mempromosikan kemampuan, pengalaman, proyek dan pencapaian saya di bidang Ilmu Komputer, serta untuk  membentangkan karir saya dan/atau memikat klien potensial.",
          "Halaman yang tersedia saat ini meliputi Home, Projects untuk menampilkan semua proyek yang telah diselesaikan hingga saat ini, Certifications untuk menampilkan semua sertifikat yang telah diperoleh, dan Detail Proyek untuk melihat rincian spesifik setiap proyek."
        ],
        "english": [
          "This project is my personal portfolio website developed using Vue.js + Vite framework and Tailwind CSS framework by applying single page application using vue router. The typography used is Lato from Google Fonts & the icons used in this website is Boxicons. The aim of developing this website is to introduce my personal brand, promote my skills, experience, projects and achievements in the field of Computer Science, and to expand my career and/or entice potential clients.",
          "The currently available pages include Home, Projects, which showcases all completed projects to date, Certifications, which displays all earned certificates, and Project Details, which allows users to view specific information about each project."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Node.js",
            "url": "https://nodejs.org/en",
            "version": "20.12.2+",
            "usage": "Menjalankan JavaScipt di luar peramban"
          },
          {
            "name": "JavaScript",
            "url": "https://262.ecma-international.org/",
            "version": "ES6 (2015)",
            "usage": "Bahasa pemrograman utama"
          },
          {
            "name": "Vue.js",
            "url": "https://vuejs.org/",
            "version": "3.4.21+",
            "usage": "Kerangka JavaScript untuk mempercepat pengembangan aplikasi front-end"
          },
          {
            "name": "Tailwind CSS",
            "url": "https://tailwindcss.com/",
            "version": "3.4.3+",
            "usage": "Kerangka kerja CSS untuk mempercepat pembuatan tampilan antarmuka pengguna situs web yang modern dan indah"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.1.4+",
            "usage": "Ikon untuk menghiasi situs web"
          },
          {
            "name": "Vite",
            "url": "https://vite.dev/",
            "version": "5.2.8+",
            "usage": "Alat pembangunan untuk mempercepat dan merampingkan pengembangan web modern"
          },
          {
            "name": "Vue Router",
            "url": "https://router.vuejs.org/",
            "version": "4.3.0+",
            "usage": "Pustaka perute resmi dari Vue untuk membuat aplikasi halaman tunggal"
          },

          {
            "name": "date-fns",
            "url": "https://date-fns.org/",
            "version": "4.1.0+",
            "usage": "Pustaka JavaScript untuk manipulasi tanggal"
          }
        ],
        "english": [
          {
            "name": "Node.js",
            "url": "https://nodejs.org/en",
            "version": "20.12.2+",
            "usage": "Execute JavaScipt outside the browser"
          },
          {
            "name": "JavaScript",
            "url": "https://262.ecma-international.org/",
            "version": "ES6 (2015)",
            "usage": "Main programming language"
          },
          {
            "name": "Vue.js",
            "url": "https://vuejs.org/",
            "version": "3.4.21+",
            "usage": "JavaScript framework to accelerate front-end application development"
          },
          {
            "name": "Tailwind CSS",
            "url": "https://tailwindcss.com/",
            "version": "3.4.3+",
            "usage": "CSS framework to accelerate the creation of modern and beautiful website user interfaces"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.1.4+",
            "usage": "Icons to decorate the website"
          },
          {
            "name": "Vite",
            "url": "https://vite.dev/",
            "version": "5.2.8+",
            "usage": "Build tool to accelerate and streamline modern web development"
          },
          {
            "name": "Vue Router",
            "url": "https://router.vuejs.org/",
            "version": "4.3.0+",
            "usage": "The official Vue router library for building single-page application"
          },

          {
            "name": "date-fns",
            "url": "https://date-fns.org/",
            "version": "4.1.0+",
            "usage": "JavaScript library to manipulate dates"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Mengembangkan dan memelihara aplikasi web responsif serta merancang antarmuka pengguna menggunakan Vue.js, sambil memastikan kompatibilitas lintas-peramban dan kinerja yang optimal",
              "Menggunakan Vue Router untuk membuat aplikasi halaman tunggal sehingga menghasilkan navigasi halaman yang mulus"
            ],
            "english": [
              "Designed and managed responsive web applications and designed user interface using Vue.js, ensuring multi-browser compatibility and optimal performance",
              "Utilized Vue Router to create a single page application for seamless page navigation"
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2024-12-31",
    "license": ""
  },
  {
    "id": 4,
    "name": "Content Management Web Application",
    "category": "Full-stack Development",
    "description": {
      "indonesia": "Sebuah aplikasi web pengelolan konten youtube untuk kreator, dikembangkan menggunakan bahasa pemrograman PHP dan kerangka kerja Laravel, dan basis data MySQL.",
      "english": "A YouTube content management web application for creator, developed using PHP programming language and Laravel framework, and MySQL database."
    },
    "technology": [
      "HTML",
      "CSS",
      "JavaScript",
      "SASS",
      "Bootstrap CSS",
      "PHP",
      "Laravel",
      "MySQL"
    ],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Full-stack Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://github.com/bagusperdanay7/ks_web",
    "url": "",
    "thumbnail": {
      "src": "/image/projects/content-management-wa/preview-home-cms.png",
      "caption": "Preview of Home page Content Management web apps",
      "original": true
    },
    "previews": [
      {
        "preview": "/image/projects/content-management-wa/preview-home-cms.png",
        "caption": "Preview of Home page Content Management web apps"
      }
    ],
    "details": {
      "about": {
        "indonesia": [
          "Aplikasi web pengelolaan konten adalah sebuah aplikasi web untuk pengelolaan konten YouTube dikembangkan menggunakan kerangka kerja Laravel dengan bahasa pemrograman PHP, dan MySQL sebagai basis data relasional. Tujuan aplikasi ini adalah untuk memfasilitasi sang kreator untuk mengelola konten, melacak permintaan konten dari pelanggan-pelanggan, membantu pelanggan temukan konten yang dibuat oleh kreator berdasarkan kategori konten, dan membagikan model AI (Artificial Intelligence) yang dibuat kreator. Tipografi yang digunakan adalah Poppins & Inter dari Google Fonts, dan ikon yang digunakan adalah Line Awesome & Boxicons.",
          "Aplikasi ini dikategorisasikan menjadi tiga jenis pengguna: Administrator (eksklusif untuk pemilik), Editor, dan Pengguna (diberikan kepada pelanggan dan pengunjung web). Fungsionalitas aplikasi mencakup autentikasi pengguna dan Administrator/Editor, pendaftaran & masuk, dasbor Administrator, autentikasi masuk dengan Google, pengaturan ulang kata sandi, pengelolaan profil akun (meliputi unggah dan penggantian gambar profil), formulir permintaan, operasi CRUD (Create, Read, Update, Delete) pada model, pemungutan suara konten, pencarian & penyortiran konten dan permintaan, penjadwalan unggahan konten, dan daftar permintaan lengkap dari pelanggan.",
          ""
        ],
        "english": [
          "Content Management Web Application is a web application for managing YouTube content developed using the Laravel framework with the PHP programming language, and MySQL as a relational database. The purpose of this application is to facilitate the creator in managing content, tracking content requests from subscribers, helping subscribers find content created by the creator based on content categories, and sharing AI (Artificial Intelligence) models produced by creators. The typographies used are Poppins and Inter from Google Fonts, and the icons used are Line Awesome & Boxicons.",
          "The application is divided into three user categories: Administrator (exclusive to the owner), Editor, and User (intended for customers and web visitors). Its functionalities include authentication for users and Administrators/Editors, registration and login, an Administrator dashboard, Google login integration, password reset, account profile management (with profile picture upload and change), request form, CRUD operations (Create, Read, Update, Delete) for models, content voting, content and request search, filtering, and sorting, content upload schedule, and a detailed list of subscriber requests."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "PHP",
            "url": "https://www.php.net",
            "version": "8.2.0+",
            "usage": "Bahasa pemrograman utama"
          },
          {
            "name": "Node.js",
            "url": "https://nodejs.org/en",
            "version": "18.1.1+",
            "usage": "Menjalankan JavaScipt di luar peramban"
          },
          {
            "name": "Laravel Socialite",
            "url": "https://laravel.com/docs/11.x/socialite",
            "version": "5.13+",
            "usage": "Antarmuka untuk autentikasi OAuth dengan berbagai jejaring sosial"
          },
          {
            "name": "Laravel",
            "url": "https://laravel.com/",
            "version": "10.1.0+",
            "usage": "Kerangka PHP untuk mempercepat pengembangan aplikasi"
          },
          {
            "name": "Laragon (PHP, MySQL, Apache, dll)",
            "url": "https://laragon.org/",
            "version": "6.0+",
            "usage": "Peladen web lokal untuk mengembangkan web"
          },
          {
            "name": "MySQL",
            "url": "https://www.mysql.com/",
            "version": "8.0+",
            "usage": "Database Management System (DBMS)"
          },
          {
            "name": "Composer",
            "url": "https://getcomposer.org",
            "version": "2.20+",
            "usage": "Pengelola dependensi"
          },
          {
            "name": "Bootstrap CSS",
            "url": "https://getbootstrap.com",
            "version": "5.3.0+",
            "usage": "Kerangka kerja CSS untuk mempercepat implementasi Antarmuka pengguna"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.1.4+",
            "usage": "Ikon sebagai elemen hiasan dalam desain laman web"
          },
          {
            "name": "Line Awesome",
            "url": "https://icons8.com/line-awesome",
            "version": "1.3.0+",
            "usage": "Icon pack untuk situs web"
          },
          {
            "name": "Alpine Js",
            "url": "https://alpinejs.dev/",
            "version": "3.0+",
            "usage": "Pustaka JavaScript untuk mengatur perilaku secara langsung di HTML"
          },
          {
            "name": "Chart.js",
            "url": "https://www.chartjs.org/",
            "version": "4.4.1+",
            "usage": "Pustaka JavaScript untuk diagram yang modern"
          },
          {
            "name": "SASS",
            "url": "https://sass-lang.com/",
            "version": "2.0+",
            "usage": "Praprosesor CSS"
          },
          {
            "name": "Vite",
            "url": "https://vite.dev/",
            "version": "5.0.1+",
            "usage": "Alat pembangunan untuk mempercepat dan merampingkan pengembangan web modern"
          },
          {
            "name": "Visual Studio Code",
            "url": "https://code.visualstudio.com/",
            "version": "Latest",
            "usage": "Penyunting kode"
          }
        ],
        "english": [
          {
            "name": "PHP",
            "url": "https://www.php.net",
            "version": "8.2.0+",
            "usage": "Main programming language"
          },
          {
            "name": "Node.js",
            "url": "https://nodejs.org/en",
            "version": "18.1.1+",
            "usage": "Execute JavaScipt outside the browser"
          },
          {
            "name": "Laravel",
            "url": "https://laravel.com/",
            "version": "10.1.0+",
            "usage": "PHP framework to accelerate application development"
          },
          {
            "name": "Laravel Socialite",
            "url": "https://laravel.com/docs/11.x/socialite",
            "version": "5.13+",
            "usage": "Interface to OAuth authentication with various social networks"
          },
          {
            "name": "Laragon (PHP, MySQL, Apache, dll)",
            "url": "https://laragon.org/",
            "version": "6.0+",
            "usage": "Local web server for web development"
          },
          {
            "name": "MySQL",
            "url": "https://www.mysql.com/",
            "version": "8.0+",
            "usage": "Database Management System (DBMS)"
          },
          {
            "name": "Composer",
            "url": "https://getcomposer.org",
            "version": "2.20+",
            "usage": "Dependency manager"
          },
          {
            "name": "Bootstrap CSS",
            "url": "https://getbootstrap.com",
            "version": "5.3.0+",
            "usage": "CSS framework to accelerate implementation User interface"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.1.4+",
            "usage": "Icons as ornamental elements in webpage design"
          },
          {
            "name": "Line Awesome",
            "url": "https://icons8.com/line-awesome",
            "version": "1.3.0+",
            "usage": "The icon pack for website"
          },
          {
            "name": "Alpine Js",
            "url": "https://alpinejs.dev/",
            "version": "3.0+",
            "usage": "JavaScript library to set behavior directly in HTML"
          },
          {
            "name": "Chart.js",
            "url": "https://www.chartjs.org/",
            "version": "4.4.1+",
            "usage": "JavaScript library for modern diagrams"
          },
          {
            "name": "SASS",
            "url": "https://sass-lang.com/",
            "version": "2.0+",
            "usage": "CSS Preprocessor"
          },
          {
            "name": "Vite",
            "url": "https://vite.dev/",
            "version": "5.0.1+",
            "usage": "Build tool to accelerate and streamline modern web development"
          },
          {
            "name": "Visual Studio Code",
            "url": "https://code.visualstudio.com/",
            "version": "Latest",
            "usage": "Code editor"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang, mengembangkan dan memelihara  aplikasi web menggunakan bahasa pemrograman PHP, kerangka kerja Laravel, SASS, kerangka kerja Bootstrap, dan basis data MySQL.",
              "Mendesain struktur basis data yang efisien dan mengoptimalkan query untuk memastikan aplikasi berjalan dengan cepat dan responsif",
              "Mengimplementasikan sistem autentikasi yang aman menggunakan framework Laravel, termasuk mekanisme login baik login dengan email maupun login yang terhubung dengan aplikasi pihak ketiga (Google), pendaftaran akun, pengelolaan sesi pengguna,  pengaturan dan pengelolaan akun, serta fitur reset password.",
              "Mengolah fitur CRUD (Create, Read, Update, Delete) dan filter yang baik dan efisien untuk berbagai jenis data, juga dilengkapi dengan kontrol akses berbasis peran (Role Based Access Control).",
              "Menangani debugging dan pemecahan masalah untuk memastikan aplikasi berfungsi dengan baik dan bebas dari kerentanan keamanan.",
              "Menyebarkan (deploy) aplikasi secara publik pada web hosting dengan memanfaatkan Git sebagai Version Control System dan GitHub sebagai wadah penyimpanan kode secara publik."
            ],
            "english": [
              "Designed, developed, and maintained a web app using the PHP programming language, the Laravel framework, SASS, the Bootstrap framework, and MySQL Database.",
              "Designed efficient database structures and optimized queries to ensure applications run quickly and responsively.",
              "Implemented a secure authentication system using the Laravel framework, including login mechanisms (either login with email or login connected to third-party applications like Google), account registration, user session management, account settings and management, and password reset features.",
              "Managed good and efficient CRUD (Create, Read, Update, Delete) and filter features for various types of data; it also comes with role-based access control.",
              "Conducted debugging and troubleshooting to guarantee the proper functioning of applications and their safety from security vulnerabilities.",
              "Deployed the application publicly on web hosting by utilizing Git as a version control system and GitHub as a public code storage platform."
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2024-01-31",
    "license": ""
  },
  {
    "id": 5,
    "name": "Final Project Dicoding - Image Classification",
    "category": "Machine Learning",
    "description": {
      "indonesia": "Sebuah program pembelajaran mesin dikembangkan menggunakan Python dan TensorFlow, yang mengimplementasikan algoritma Convolutional Neural Network untuk mengklasifikasikan gambar batu-gunting-kertas. Program ini dirancang untuk mendukung penyelesaian kursus Belajar Machine Learning untuk Pemula dari Dicoding Indonesia.",
      "english": "A machine learning application built with Python and TensorFlow, implementing the Convolutional Neural Network algorithm to classify images of rock, scissors, and paper. This project is designed to aid in completing Dicoding Indonesia's Machine Learning for Beginners course."
    },
    "technology": [
      "Python",
      "Numpy",
      "Matplotlib",
      "TensorFlow",
      "AI",
      "Deep Learning",
      "Computer Vision",
      "Image Classification"
    ],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Data Scientist",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://github.com/bagusperdanay7/final-project-dicoding",
    "url": "",
    "thumbnail": {
      "src": "/image/projects/dicoding/rock-paper-scissors.jpg",
      "caption": "Illustration of Rock Paper Scissors Image Classification Project",
      "original": false
    },
    "previews": null,
    "details": {
      "about": {
        "indonesia": [
          "Proyek ini merupakan tugas akhir dari kursus Dicoding untuk menyelesaikan kursus Belajar Machine Learning untuk Pemula yang diselenggarakan oleh Dicoding Indonesia. Tugas ini melibatkan pembuatan klasifikasi gambar untuk permainan batu-gunting-kertas menggunakan bahasa pemrograman Python dan kerangka kerja pembelajaran mesin TensorFlow. Dalam proyek ini, algoritma deep learning yang digunakan adalah Convolutional Neural Network (CNN), yang berhasil mencapai akurasi pelatihan sebesar 97,5% dan akurasi validasi sebesar 98,75%. Selain itu, dilakukan augmentasi data citra yang mencakup pengubahan ukuran, rotasi, pembalikan horizontal, pergeseran, pembesaran, serta penyesuaian panjang dan lebar gambar selama tahap pelatihan model."
        ],
        "english": [
          "This project serves as the final assignment for the Dicoding course aimed at completing the Learn Machine Learning for Beginners program organized by Dicoding Indonesia. The task involves developing an image classification system for the rock-paper-scissors game using Python and the TensorFlow machine learning framework. The deep learning algorithm employed in this project is the Convolutional Neural Network (CNN), which achieved a training accuracy of 97.5% and a validation accuracy of 98.75%. Additionally, image data augmentation techniques were applied, including resizing, rotation, horizontal flipping, shifting, zooming, and adjusting the length and width of images during the model training phase."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Python",
            "url": "https://www.python.org/",
            "version": "3.10.0+",
            "usage": "Bahasa pemrograman utama"
          },
          {
            "name": "Numpy",
            "url": "https://numpy.org/",
            "version": "1.26.0+",
            "usage": "Pustaka Python untuk membantu melakukan komputasi ilmiah"
          },
          {
            "name": "Matplotlib",
            "url": "https://matplotlib.org/",
            "version": "3.6.0+",
            "usage": "Pustaka Python untuk memvisualisasikan data secara interaktif"
          },
          {
            "name": "TensorFlow",
            "url": "https://www.tensorflow.org/",
            "version": "2.0+",
            "usage": "Platform to make machine learning more powerful and fast"
          },
          {
            "name": "split-folders",
            "url": "https://github.com/jfilter/split-folders",
            "version": "0.5.1+",
            "usage": "Pustaka Python untuk memisahkan folder"
          },
          {
            "name": "Google Colab",
            "url": "https://colab.research.google.com/",
            "version": "Latest",
            "usage": "Layanan Jupyter Notebook daring yang disediakan oleh Google untuk mempercepat komputasi pembelajaran mesin dengan dukungan GPU"
          }
        ],
        "english": [
          {
            "name": "Python",
            "url": "https://www.python.org/",
            "version": "3.10.0+",
            "usage": "Main programming language"
          },
          {
            "name": "Numpy",
            "url": "https://numpy.org/",
            "version": "1.26.0+",
            "usage": "Python library to help perform scientific computing"
          },
          {
            "name": "Matplotlib",
            "url": "https://matplotlib.org/",
            "version": "3.6.0+",
            "usage": "Python library for visualizing data interactively"
          },
          {
            "name": "TensorFlow",
            "url": "https://www.tensorflow.org/",
            "version": "2.0+",
            "usage": "Platform to make machine learning more powerful and fast"
          },
          {
            "name": "split-folders",
            "url": "https://github.com/jfilter/split-folders",
            "version": "0.5.1+",
            "usage": "Python library to split folder"
          },
          {
            "name": "Google Colab",
            "url": "https://colab.research.google.com/",
            "version": "Latest",
            "usage": "An online Jupyter Notebook service provided by Google to accelerate machine learning computing with GPU support"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang model algoritma pembelajaran mendalam jenis Convolutional Neural Network untuk mengklasifikasikan gambar permainan gunting-batu-kertas.",
              "Penerapan augmentasi gambar yang meliputi pengubahan ukuran, rotasi, pembalikan horizontal, pergeseran, pembesaran, dan pergeseran panjang dan lebar pada tahapan pelatihan model, serta pemanfaatan image data generator pada data gambar."
            ],
            "english": [
              "Designed a Convolutional Neural Network type deep learning algorithm model to classify images of a rock-paper-scissors game.",
              "Applied various image augmentation methods including resizing, rotating, horizontal flipping, shifting, zooming, and adjusting length and width during the model training stage, utilizing an image data generator for the image data."
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2023-11-13",
    "license": ""
  },
  {
    "id": 6,
    "name": "Portofolio UI & UX Design",
    "category": "UI & UX Design",
    "description": {
      "indonesia": "Desain antarmuka dan pengalaman pengguna (UI & UX) untuk situs web portofolio pribadi saya menggunakan Figma.",
      "english": "Design of user interface and user experience (UI & UX) for my personal portfolio website using Figma."
    },
    "technology": ["User Interface", "User Experience", "Figma"],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "UI & UX Designer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://dribble.com",
    "url": "https://www.figma.com/design/35sKqytEGhNRZWrbwHT9sL/Website-Portfolio?node-id=141-2&t=4OiZcMccM3phYRwJ-1",
    "thumbnail": {
      "src": "/image/projects/portfolio/preview-home-portfolio.png",
      "caption": "Preview of Portfolio Home page UI & UX design",
      "original": true
    },
    "previews": {
      "preview": "https://embed.figma.com/design/35sKqytEGhNRZWrbwHT9sL/Website-Portfolio?node-id=141-2&embed-host=share",
      "caption": "Figma embed content"
    },
    "details": {
      "about": {
        "indonesia": [
          "Ini merupakan hasil desain antarmuka pengguna dan pengalaman pengguna perangkat situs web untuk portofolio saya menggunakan aplikasi Figma. Proses desainnya mencakut pembuata sistem desain meliputi palet warna, tipografi dengan ukuran yang berbeda, gaya grid, dan pembuatan beberapa komponen seperti tombol, avatar, ikon, lencana, dan kartu. Selanjutnya, membuat kerangka desain (wireframe) dan membuat purwarupa (mock-up) untuk berbagai halaman, meliputi navigasi, halaman utama, halaman detail proyek, footer, dan mode tema terang dan gelap."
        ],
        "english": [
          "This is the outcome of designing the user interface and user experience for my personal portfolio website, developed using Figma. The process included building a design system comprising a color palette, typography with various sizes, grid styles, and components like buttons, avatars, icons, badges, and cards. Subsequently, I created wireframes and mock-ups for different pages, including navigation, the home page, project detail page, footer, and both light and dark theme modes."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Figma",
            "url": "https://www.figma.com/",
            "version": "Latest",
            "usage": "Perangkat lunak desain berbasis web untuk membuat antarmuka pengguna (UI) dan pengalaman pengguna (UX)"
          },
          {
            "name": "Tailwind CSS Color Generator",
            "url": "https://uicolors.app/create",
            "version": "-",
            "usage": "Alat Pembangkit warna untuk Tailwind CSS"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "-",
            "usage": "Ikon sebagai elemen hiasan dalam desain laman web"
          }
        ],
        "english": [
          {
            "name": "Figma",
            "url": "https://www.figma.com/",
            "version": "Latest",
            "usage": "Web-based design software for creation of user interface (UI) and user experience (UX)"
          },
          {
            "name": "Tailwind CSS Color Generator",
            "url": "https://uicolors.app/create",
            "version": "-",
            "usage": "Tailwind CSS color generator tool"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "-",
            "usage": "Icons as ornamental elements in webpage design"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang antarmuka dan pengalaman pengguna untuk aplikasi web menggunakan alat standar industri yaitu Figma, memastikan pengalaman pengguna yang mulus dan menarik secara visual.",
              "Membuat kerangka desain dan purwarupa untuk mengomunikasikan konsep desain secara efektif, memanfaatkan fitur figma dengan baik seperti tata letak otomatis, komponen dan variasinya.",
              "Membangun sistem desain skala kecil, termasuk palet warna, tipografi, pustaka komponen untuk menjaga konsistensi pada seluruh elemen desain produk ini."
            ],
            "english": [
              "Designed the user interface and user experience for the web application using the industry-standard tool Figma, ensuring a seamless and visually appealing user experience.",
              "Created wireframes and mock-ups to effectively communicate design concepts, properly utilizing figma features such as auto-layouts, components and variants.",
              "Established a small-scale design system encompassing a color palette, typography, and a component library to ensure consistent design elements throughout the product."
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2024-12-24",
    "license": "CC By 4.0"
  },
  {
    "id": 7,
    "name": "IT Course UI & UX - Software Management Project Course (College)",
    "category": "UI & UX Design",
    "description": {
      "indonesia": "Design antarmuka pengguna (UI) & pengalaman pengguna (UX) dari IT Course yang merupakan tugas besar akhir mata kuliah Manajemen Proyek Perangkat Lunak dengan dosen pengampu Bapak Irfan Maliki, S.T, M.T., CIPTM.",
      "english": "The user interface (UI) and user experience (UX) design for the IT Course, which serves as the final major project for the Software Project Management course taught by Mr. Irfan Maliki, S.T., M.T., CIPTM, has been developed."
    },
    "technology": ["Figma", "User Interface", "User Experience"],
    "contributors": [
      {
        "name": "Akbar Saleh Alfian",
        "role": "Quality assurance",
        "profile": "https://www.instagram.com/akbarsaleh_alfian",
        "avatar": "/image/avatar/akbarsa.jpg"
      },
      {
        "name": "Bagus Perdana Yusuf",
        "role": "UI & UX Designer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      },
      {
        "name": "Raden Fachrul Ramzy Muhammad",
        "role": "UI & UX Designer",
        "profile": "https://www.linkedin.com/in/raden-fachrul-605a12341/",
        "avatar": "/image/avatar/raden-fachrul.jpeg"
      },
      {
        "name": "Robi Nurhidayat",
        "role": "Project Manager",
        "profile": "https://www.linkedin.com/in/robi-nurhidayat-2a857224a/",
        "avatar": "/image/avatar/robi-nurhidayat.jpeg"
      }
    ],
    "source": "",
    "url": "https://www.figma.com/design/UHWZmtqrQPkLTo1km7YPZn/Design?node-id=221-2&t=xbWhRukquGqFVqyI-1",
    "thumbnail": {
      "src": "/image/projects/ui-ux-course/landing-page-preview.png",
      "caption": "Preview of Landing Page Course UI & UX Design",
      "original": true
    },
    "previews": {
      "preview": "https://embed.figma.com/design/UHWZmtqrQPkLTo1km7YPZn/Design?node-id=221-2&embed-host=share",
      "caption": "Preview of Landing Page Course UI & UX Design Figma Embeded"
    },
    "details": {
      "about": {
        "indonesia": [
          "Ini adalah hasil desain antarmuka pengguna (UI) dan pengalaman pengguna (UX) untuk sistem IT Course menggunakan Figma. Proses pengerjaan mencakup pembuatan palet warna, penentuan gaya tipografi dengan berbagai ukuran, serta perancangan kerangka desain (wireframe) untuk setiap halaman. Selanjutnya, dilakukan pembuatan mock-up setiap halaman dan purwarupa untuk memvisualisasikan alur aplikasi kepada pengguna. Tipografi yang digunakan adalah Poppins dan Roboto dari Google Fonts, dengan ikon dari Material Symbols and Icons dari Google Fonts, serta kombinasi Boxicons dan css.gg. Ilustrasi diperoleh dari freepik.com, untuk gambar gratis diambil dari Unsplash, sementara logo didesain oleh Bagus Perdana Yusuf.",
          "Halaman-halaman yang dibuat dalam tahap wireframing dan mock-up meliputi halaman landasan, tentang kami, kontak kami, daftar kursus, mentor, testimonial, registrasi akun, login, dasbor pengguna, dasbor kelas, halaman pembayaran, serta pengaturan akun termasuk ubah kata sandi dan ubah profil."
        ],
        "english": [
          "This is the end result of using Figma to create the user interface (UI) and user experience (UX) for the IT Course system. The design process involved creating a color palette, selecting various typography styles and sizes, and designing wireframes for each page. Subsequently, mock-ups and prototypes of each page were developed to visualize the application's flow to users. The font utilized was Google Fonts' Poppins and Roboto, with icons from Material Symbols and Icons, as well as a combination of Boxicons and css.gg. The illustrations were sourced from freepik.com, free images taken from Unsplash, and the logo was designed by Bagus Perdana Yusuf.",
          "The pages created in the wireframing and mock-up stages include the landing page, about us, contact us, course list, mentors, testimonials, account sign-up, login, user dashboard, class dashboard, payment page, as well as account settings including change password and change profile."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Figma",
            "url": "https://www.figma.com/",
            "version": "Latest",
            "usage": "Perangkat lunak desain berbasis web untuk membuat antarmuka pengguna (UI) dan pengalaman pengguna (UX)"
          },
          {
            "name": "Freepik",
            "url": "https://www.freepik.com/",
            "version": "-",
            "usage": "Tempat mencari Stok gambar dan ilustrasi gratis"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.0.8+",
            "usage": "Ikon sebagai elemen hiasan dalam desain laman web"
          },
          {
            "name": "css.gg",
            "url": "https://css.gg/",
            "version": "-",
            "usage": "Pustaka ikon gratis dengan CSS"
          },
          {
            "name": "Unsplash",
            "url": "https://unsplash.com/",
            "version": "-",
            "usage": "Tempat mencari gambar gratis"
          },
          {
            "name": "Google Font",
            "url": "https://fonts.google.com/",
            "version": "-",
            "usage": "Sumber terbuka untuk tipografi dan Ikon dari Google"
          }
        ],
        "english": [
          {
            "name": "Figma",
            "url": "https://www.figma.com/",
            "version": "Latest",
            "usage": "Web-based design software for creation of user interface (UI) and user experience (UX)"
          },
          {
            "name": "Freepik",
            "url": "https://www.freepik.com/",
            "version": "-",
            "usage": "A place for searching images and illustrations stock freely"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.0.8+",
            "usage": "Icons as ornamental elements in webpage design"
          },
          {
            "name": "css.gg",
            "url": "https://css.gg/",
            "version": "-",
            "usage": "Free icons library with CSS"
          },
          {
            "name": "Unsplash",
            "url": "https://unsplash.com/",
            "version": "-",
            "usage": "A place to discover free images"
          },
          {
            "name": "Google Font",
            "url": "https://fonts.google.com/",
            "version": "-",
            "usage": "Open source for typography and Icons from Google"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Akbar Saleh Alfian",
          "detail": {
            "indonesia": [
              "Mengerjakan pengujian kegunaan untuk memastikan antarmuka yang intuitif dan mudah dinavigasi oleh pengguna.",
              "Melakukan pengujian purwarupa untuk mengidentifikasi masalah desain sebelum produk akhir dibuat, serta memastikan semua interaksi elemen berfungsi dengan benar."
            ],
            "english": [
              "Conducted usability testing to ensure an intuitive and easy-to-navigate interface for users.",
              "Tested prototypes to find design flaws before the finished product was constructed and made sure all element interactions were working properly."
            ]
          }
        },
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang antarmuka dan pengalaman pengguna untuk aplikasi web menggunakan alat standar industri yaitu Figma, memastikan pengalaman pengguna yang mulus dan menarik secara visual.",
              "Membuat palet warna & gaya tipografi yang bervariasi, kerangka desain, malet dan purwarupa untuk mengomunikasikan konsep desain secara efektif."
            ],
            "english": [
              "Designed the user interface and user experience for the web application using the industry-standard tool Figma, ensuring a seamless and visually appealing user experience.",
              "Created a variety of color palettes & typography style, wireframes, mock-ups, and prototypes to efficiently convey design concepts."
            ]
          }
        },
        {
          "name": "Raden Fachrul Ramzy Muhammad",
          "detail": {
            "indonesia": [
              "Merancang antarmuka dan pengalaman pengguna untuk aplikasi web menggunakan alat standar industri yaitu Figma, memastikan pengalaman pengguna yang mulus dan menarik secara visual.",
              "Membuat kerangka desain, dan malet untuk mengomunikasikan konsep desain secara efektif."
            ],
            "english": [
              "Designed the user interface and user experience for the web application using the industry-standard tool Figma, ensuring a seamless and visually appealing user experience.",
              "Created wireframes, and mock-ups to efficiently convey design concepts."
            ]
          }
        },
        {
          "name": "Robi Nurhidayat",
          "detail": {
            "indonesia": [
              "Memimpin tim yang terdiri dari empat anggota, merancang dan melaksanakan rencana proyek yang komprehensif sesuai dengan anggaran, sumber daya, dan tujuan yang telah ditetapkan. Menjamin komunikasi yang efisien antar anggota tim, memantau perkembangan desain secara berkala. ",
              "Melakukan evaluasi desain secara rutin guna menjamin kesesuaian, serta menyusun laporan evaluatif untuk mengkaji kinerja desain akhir."
            ],
            "english": [
              "Led a team of four members, designing and executing a comprehensive project plan in accordance with established budgets, resources, and objectives. Maintained efficient communication among team members and regularly monitored design progress.",
              "Conducted frequent design evaluations to ensure adherence to standards and compiled reports to assess final design performance."
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2021-08-04",
    "license": "CC By 4.0"
  },
  {
    "id": 8,
    "name": "IT Course Website - Software Management Project Course (College)",
    "category": "Full-stack Development",
    "description": {
      "indonesia": "Sebuah kursus khusus materi Teknologi dan Informasi berbasis web dibangun dengan bahasa pemrograman PHP dan kerangka kerja Laravel. Projek ini ditujukan untuk Tugas Besar Mata Kuliah Manajemen Proyek Perangkat Lunak dengan dosen pengampu Bapak Irfan Maliki, S.T, M.T., CIPTM.",
      "english": "A web-based Information and Technology course built with PHP programming language and Laravel framework. This project is aimed for the Big Final Project Assignment of the Software Project Management course with the lecturer Mr. Irfan Maliki, S.T, M.T., CIPTM."
    },
    "technology": [
      "HTML",
      "CSS",
      "JavaScript",
      "PHP",
      "Laravel",
      "Bootstrap CSS",
      "MySQL",
      "Git"
    ],
    "contributors": [
      {
        "name": "Akbar Saleh Alfian",
        "role": "Quality assurance",
        "profile": "https://www.instagram.com/akbarsaleh_alfian",
        "avatar": "/image/avatar/akbarsa.jpg"
      },
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Front-end Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      },
      {
        "name": "Raden Fachrul Ramzy Muhammad",
        "role": "Front-end Developer",
        "profile": "https://www.linkedin.com/in/raden-fachrul-605a12341/",
        "avatar": "/image/avatar/raden-fachrul.jpeg"
      },
      {
        "name": "Robi Nurhidayat",
        "role": "Project Manager, Full-stack Developer",
        "profile": "https://www.linkedin.com/in/robi-nurhidayat-2a857224a/",
        "avatar": "/image/avatar/robi-nurhidayat.jpeg"
      }
    ],
    "source": "https://github.com/Robi-Nurhidayat/project-baru",
    "url": "",
    "thumbnail": {
      "src": "/image/projects/it-course-website/it-course-homepage-preview.png",
      "caption": "Homepage Preview of IT Course Website",
      "original": true
    },
    "previews": [
      {
        "preview": "/image/projects/it-course-website/it-course-homepage-preview.png",
        "caption": "Homepage Preview of IT Course Website"
      }
    ],
    "details": {
      "about": {
        "indonesia": [
          "Perhatian: Sistem ini belum berfungsi optimal dan sesuai harapan karena keterbatasan waktu. Pengembangan ini bertujuan utama untuk menyelesaiankan tugas besar mata kuliah Manajemen Proyek Perangkat Lunak sekaligus mengimplementasikan konsepnya dalam konteks dunia nyata. Kami menyadari bahwa aplikasi ini masih memiliki banyak kekurangan. Oleh karena itu, kami mohon pengertian Anda. Maka dari itu harap memakluminya.",
          "Segala bentuk materi seperti video kelas sepenuhnya milik hak yang bersangkutan. Kami tidak bermaksud memperjualkan video-video tutorial gratis tersebut kepada pembeli kursus, karena ini hanya bentuk pengembangan untuk tujuan akademis dan pembelajaran. Mohon bijaksana dalam mengambil keputusan. Terima kasih atas pengertiannya.",
          "ITCourse adalah sebuah situs web belajar daring dengan berbasis aplikasi dan teknologi. Disini para pelajar atau masyarakat dapat belajar tentang Pemrograman. Dalam sistem ini terdapat tiga pengguna yang berhubungan dengan sistem ini, yaitu pelajar, pengajar, dan admin. Pelajar merupakan user yang akan menggunakan aplikasi ini, dalam melakukan pembelajaran. Pengajar merupakan pemangku kepentingan yang akan memberikan pelajaran kepada pelajar. Kemudian Admin disini bertugas mengawasi sistem yang berjalan. Tipografi yang diterapkan dalam sistem ini mencakup Poppins, Roboto, Nunito, dan Material Icons dari Google Fonts. Untuk ikon, sistem ini memanfaatkan koleksi dari Boxicon.",
          "Fitur aplikasi meliputi mekanisme otentikasi masuk, pendaftaran pelajar dan admin, serta kapabilitas CRUD (Create, Read, Update, Delete). Admin memiliki wewenang mengelola data pengajar, termasuk penambahan, penyesuaian, penghapusan, serta penghapusan data pelajar. Pelajar dapat mengelola informasi akun mereka. Sementara itu, pengunjung dapat mengirimkan pesan melalui formulir kontak, yang kemudian akan dikelola oleh admin.",
          "Halaman-halaman yang terdapat dalam sistem ITCourse mencakup: halaman landasan, tentang kami, kontak kami, login pelajar, sign-up pelajar, login admin, sign-up admin, paket belajar (pricing plan), pembayaran, transaksi tersimpan (terdaftar), beranda pelajar, daftar kursus, detail kursus, pengaturan akun pengguna, dasbor admin, daftar pelajar di dasbor admin, daftar pengajar di dasbor admin, pesan dari user (contact), penghapusan pesan user, dan daftar transaksi di dasbor admin."
        ],
        "english": [
          "Notice: This system has not yet reached optimal functionality due to time constraints. The primary goal of this development is to fulfill a major assignment for the Software Project Management course while applying its concepts in a real-world context. We acknowledge that this application has several shortcomings. Therefore, we kindly ask for your understanding.",
          "All materials, including class videos, are the intellectual property of their respective owners. We have no intention of selling these free video tutorials to course participants, as this project is solely developed for academic and educational purposes. We kindly ask you to exercise wisdom and discretion in making decisions. Thank you for your understanding.",
          "ITCourse is an online learning platform that leverages applications and technology to teach Programming. The system includes three types of users: students, teachers, and admins. Students are the primary users who engage with the platform for learning purposes. Teachers act as stakeholders who deliver lessons to students. Admins are responsible for overseeing and managing the system's operations. The typography applied in this system includes Poppins, Roboto, Nunito, and Material Icons from Google Fonts. For icons, the system utilizes a collection from Boxicons.",
          "The application features include a login authentication mechanism, student and admin registration, and CRUD (Create, Read, Update, Delete) capabilities. Admins are authorized to manage teacher data, including creating, updating, and deleting it, as well as deleting student data. Students can manage their account information. Visitors can send messages through the contact form, which will be managed by the admin.",
          "The pages available in the ITCourse system include: landing page, about us, contact us, student login, student sign-up, admin login, admin sign-up, pricing plan, payment, saved (registered) transactions, student homepage, course list, course details, user account settings, admin dashboard, student list in admin dashboard, teacher list in admin dashboard, user message (contact), user message deletion, and transaction list in admin dashboard."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Animate On Scroll (AOS)",
            "url": "https://michalsnik.github.io/aos/",
            "version": "Latest",
            "usage": "Pustaka CSS dan JavaScript untuk menganimasikan konten"
          },
          {
            "name": "Bootstrap CSS",
            "url": "https://getbootstrap.com",
            "version": "4.6.0+",
            "usage": "Kerangka kerja CSS untuk mempercepat implementasi Antarmuka pengguna"
          },
          {
            "name": "Composer",
            "url": "https://getcomposer.org",
            "version": "2.2.0+",
            "usage": "Pengelola dependensi"
          },
          {
            "name": "PHP",
            "url": "https://www.php.net",
            "version": "7.4+",
            "usage": "Bahasa pemrograman utama"
          },
          {
            "name": "Laravel",
            "url": "https://laravel.com/",
            "version": "8.0+",
            "usage": "Kerangka PHP untuk mempercepat pengembangan aplikasi"
          },
          {
            "name": "jQuery",
            "url": "https://jquery.com/",
            "version": "3.5.1+",
            "usage": "Pustaka JavaScript untuk menulis skrip interaksi HTML dan JavaScript dengan cepat"
          },
          {
            "name": "GreenSock Animation Platform (GSAP)",
            "url": "https://gsap.com/",
            "version": "3.7.1+",
            "usage": "Pustaka JavaScript untuk animasikan konten apapun secara halus"
          },
          {
            "name": "Visual Studio Code",
            "url": "https://code.visualstudio.com/",
            "version": "Latest",
            "usage": "Penyunting kode"
          },
          {
            "name": "MySQL",
            "url": "https://www.mysql.com/",
            "version": "8.0+",
            "usage": "Database Management System (DBMS)"
          },
          {
            "name": "XAMPP (Apache, MySQL, PHP)",
            "url": "https://www.apachefriends.org/download.html",
            "version": "7.4+",
            "usage": "Peladen web lokal"
          },
          {
            "name": "Git",
            "url": "https://git-scm.com/",
            "version": "2.20.1+",
            "usage": "Sistem kontrol versi"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.0.8+",
            "usage": "Ikon sebagai elemen hiasan dalam desain laman web"
          },
          {
            "name": "Draw.io",
            "url": "https://app.diagrams.net/",
            "version": "-",
            "usage": "Pembuatan Entity Relational Diagram (ERD)"
          }
        ],
        "english": [
          {
            "name": "Animate On Scroll (AOS)",
            "url": "https://michalsnik.github.io/aos/",
            "version": "Latest",
            "usage": "CSS & JavaScript library to animate contents"
          },
          {
            "name": "Bootstrap CSS",
            "url": "https://getbootstrap.com",
            "version": "4.6.0+",
            "usage": "CSS framework to accelerate implementation User interface"
          },
          {
            "name": "Composer",
            "url": "https://getcomposer.org",
            "version": "2.2.0+",
            "usage": "Dependency manager"
          },
          {
            "name": "PHP",
            "url": "https://www.php.net",
            "version": "7.4+",
            "usage": "Main programming language"
          },
          {
            "name": "Laravel",
            "url": "https://laravel.com/",
            "version": "8.0+",
            "usage": "PHP framework to accelerate application development"
          },
          {
            "name": "jQuery",
            "url": "https://jquery.com/",
            "version": "3.5.1+",
            "usage": "JavaScript library for quickly scripting HTML and JavaScript interactions"
          },
          {
            "name": "GreenSock Animation Platform (GSAP)",
            "url": "https://gsap.com/",
            "version": "3.7.1+",
            "usage": "JavaScript library to smoothly animate any content"
          },
          {
            "name": "Visual Studio Code",
            "url": "https://code.visualstudio.com/",
            "version": "Latest",
            "usage": "Code editor"
          },
          {
            "name": "MySQL",
            "url": "https://www.mysql.com/",
            "version": "8.0+",
            "usage": "Database Management System (DBMS)"
          },
          {
            "name": "XAMPP (Apache, MySQL, PHP)",
            "url": "https://www.apachefriends.org/download.html",
            "version": "7.4+",
            "usage": "Local web server"
          },
          {
            "name": "Git",
            "url": "https://git-scm.com/",
            "version": "2.20.1+",
            "usage": "Version control system"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.0.8+",
            "usage": "Icons as ornamental elements in webpage design"
          },
          {
            "name": "Draw.io",
            "url": "https://app.diagrams.net/",
            "version": "-",
            "usage": "Entity Relational Diagram (ERD) Creation"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Akbar Saleh Alfian",
          "detail": {
            "indonesia": [
              "Menentukan spesifikasi dan kebutuhan perangkat lunak yang akan dikembangkan untuk klien dan pengguna.",
              "Mencatat dan menganalisis bug maupun kesalahan kode program guna meningkatkan fungsionalitas dan kinerja sistem yang optimal.",
              "Melakukan pengujian program sistem yang telah dibuat serta melacak kesalahan yang terdapat pada kode program.",
              "Menyaring dan menganalisis umpan balik dari pengguna untuk memahami kebutuhan dan masalah mereka secara mendalam, guna meningkatkan kualitas layanan dan produk yang ditawarkan.",
              "Memasukkan, menyimpan, dan melakukan perubahan pada data dokumen. Memastikan seluruh dokumen telah disimpan dengan baik dan menjaga keamanannya, serta membuang dokumen yang tidak dibutuhkan atau sudah kadaluarsa."
            ],
            "english": [
              "Determined the specifications and software requirements for development, tailored to meet the needs of clients and users.",
              "Logged and analyzed bugs and code errors to enhance functionality and ensure optimal system performance",
              "Tested the created system program and tracked errors in the program code",
              "Filtered and examined user feedback to gain a deep understanding of their needs and concerns, with the goal of enhancing the quality of the services and products provided.",
              "Inputted, stored, and updated document data. Ensured all documents were properly stored and secured, and disposed of unnecessary or outdated documents."
            ]
          }
        },
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Menentukan spesifikasi dan kebutuhan perangkat lunak yang akan dikembangkan untuk klien dan pengguna.",
              "Melakukan analisis dan akuisisi data guna mengembangkan struktur data optimal yang mampu mengelola dan memecahkan permasalahan data secara efektif.",
              "Mengembangkan perangkat lunak dan menerapkan aspek visual antarmuka pengguna dan pengalaman pengguna di sisi front-end untuk semua halaman dalam sistem ini, berdasarkan desain antarmuka yang dibuat pada tahap perancangan antarmuka dan pengalaman pengguna perangkat lunak",
              "Melakukan debugging dan pengujian terhadap program aplikasi untuk memastikan kinerja yang optimal."
            ],
            "english": [
              "Determined the specifications and software requirements for development, tailored to meet the needs of clients and users.",
              "Performed data analysis and acquisition to design an optimized data structure, effectively managing and resolving data-related issues.",
              "Developed software and implemented the front-end visual elements of the user interface and user experience for all pages in this system, based on designs created during the software's UI/UX design phase.",
              "Performed debugging and testing of application programs to ensure optimal performance."
            ]
          }
        },
        {
          "name": "Raden Fachrul Ramzy Muhammad",
          "detail": {
            "indonesia": [
              "Menentukan spesifikasi dan kebutuhan perangkat lunak yang akan dikembangkan untuk klien dan pengguna.",
              "Melakukan analisis dan akuisisi data guna mengembangkan struktur data optimal yang mampu mengelola dan memecahkan permasalahan data secara efektif.",
              "Mengembangkan perangkat lunak dan menerapkan aspek visual antarmuka pengguna dan pengalaman pengguna di sisi front-end untuk beberapa halaman dalam sistem ini, berdasarkan desain antarmuka yang dibuat pada tahap perancangan antarmuka dan pengalaman pengguna perangkat lunak.",
              "Melakukan debugging dan pengujian terhadap program aplikasi untuk memastikan kinerja yang optimal."
            ],
            "english": [
              "Determined the specifications and software requirements for development, tailored to meet the needs of clients and users.",
              "Performed data analysis and acquisition to design an optimized data structure, effectively managing and resolving data-related issues",
              "Designed and developed the software, implementing the front-end visual elements of the user interface and user experience for several pages within this system, based on the UI/UX designs created during the software's design phase.",
              "Performed debugging and testing of application programs to ensure optimal performance."
            ]
          }
        },
        {
          "name": "Robi Nurhidayat",
          "detail": {
            "indonesia": [
              "Memimpin proses perencanaan dan pelaksanaan proyek, termasuk pengelolaan anggaran serta alokasi sumber daya yang tepat.",
              "Memberikan arahan strategis dan dukungan kepada tim, sekaligus memastikan komunikasi yang efektif antar anggota tim untuk mencapai keberhasilan proyek.",
              "Memantau dan mengevaluasi kemajuan proyek secara berkala untuk memastikan kesesuaian dengan tujuan dan jadwal yang telah ditentukan.",
              "Menentukan spesifikasi dan kebutuhan perangkat lunak yang akan dikembangkan sekaligus melakukan pengembangan perangkat lunak dengan menulis kode dan menangani fungsionalitas back-end, serta berkontribusi dalam aspek visual front-end untuk panel administrasi.",
              "Melakukan debugging dan pengujian terhadap program aplikasi untuk memastikan kinerja yang optimal."
            ],
            "english": [
              "Led the project planning and execution process, including budget management and proper resource allocation.",
              "Offered strategic guidance and support to the team, fostering clear and effective communication among members to ensure the project's success",
              "Monitored and evaluated the progress of the project periodically to ensure compliance with predetermined objectives and timelines.",
              "Determined the specifications and requirements for the software under development, performed software development tasks including writing code and handling back-end functionality, and contributed to the visual design of the administration panel's front-end",
              "Performed debugging and testing of application programs to ensure optimal performance."
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2021-08-04",
    "license": ""
  },
  {
    "id": 9,
    "name": "Survey Form - Responsive Web Design Project (freecodecamp)",
    "category": "Front-end Development",
    "description": {
      "indonesia": "Sebuah halaman formulir survei sederhana dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org menggunakan HTML & CSS.",
      "english": "A simple survey form page created to complete the Responsive Web Design course provided by freecodecamp.org using HTML & CSS."
    },
    "technology": ["HTML", "CSS", "Responsive Web"],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Front-end Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://codepen.io/baguspy/pen/zYzoMyJ",
    "url": "https://codepen.io/baguspy/full/zYzoMyJ",
    "thumbnail": {
      "src": "/image/projects/freecodecamp-responsive-web-design/good4u-survey-form.png",
      "caption": "Preview of Good4U Survey Form - Freecodecamp",
      "original": true
    },
    "previews": [
      {
        "preview": "/image/projects/freecodecamp-responsive-web-design/good4u-survey-form.png",
        "caption": "Preview of Good4U Survey Form - Freecodecamp",
        "original": true
      }
    ],
    "details": {
      "about": {
        "indonesia": [
          "Proyek ini merupakan proyek mini yang dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org. Membuat sebuah formulir survei yang responsif dengan HTML dan CSS. Ini merupakan proyek pertama dari lima proyek yang harus diselesaikan pada kursus Responsive Web Design yang diadakan oleh freeCodeCamp. Tipografi yang digunakan pada situs web ini adalah Urbanist from Google Fonts. Ilustrasi didesain oleh freepik dengan penulisnya adalah story set kunjungi: https://www.freepik.com/free-vector/startup-life-concept-illustration_7117748.htm#fromView=search&page=1&position=1&uuid=9612fcdc-57e4-4ce4-ac8a-8e04ca427be1&new_detail=true untuk menggunakan ilustrasi yang sama."
        ],
        "english": [
          "This mini-project was developed to complete the Responsive Web Design course provided by freeCodeCamp.org. It involved creating a responsive survey form using HTML and CSS. This is the first of five projects to be completed in the Responsive Web Design course provided by freeCodeCamp. The typography for this website is Urbanist from Google Fonts. The illustration is designed by Freepik, and the author's name is storyset. To use the same illustration, visit: https://www.freepik.com/free-vector/startup-life-concept-illustration_7117748.htm#fromView=search&page=1&position=1&uuid=9612fcdc-57e4-4ce4-ac8a-8e04ca427be1"
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Bahasa markup standar untuk menyusun halaman web"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Bahasa lembar gaya untuk mendesain halaman web"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Penyunting kode di dalam kursus freecodecamp.org"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform untuk menyunting kode secara langsung dan memamerkan hasilnya"
          }
        ],
        "english": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Standard markup language for structuring web page"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Stylesheet language for designing web pages"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Code editor within the freecodecamp.org course"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform to edit code directly and showcase the result"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang sebuah formulir survei untuk situs web dan menjamin tampilan halaman yang responsif di berbagai perangkat."
            ],
            "english": [
              "Designed a survey form for the website and ensured the responsiveness of the page across various devices."
            ]
          }
        }
      ]
    },
    "miniProject": true,
    "lastUpdated": "2024-11-10",
    "license": "MIT"
  },
  {
    "id": 10,
    "name": "Tribute Page - Responsive Web Design Project (freecodecamp)",
    "category": "Front-end Development",
    "description": {
      "indonesia": "Sebuah halaman penghormatan tentang Bapak Pluralisme Indonesia, Abdurrahman Wahid. Dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org menggunakan HTML & CSS.",
      "english": "A tribute page about the Father of Indonesian Pluralism, Abdurrahman Wahid. Created to complete the Responsive Web Design course provided by freecodecamp.org using HTML & CSS."
    },
    "technology": ["HTML", "CSS", "Responsive Web"],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Front-end Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://codepen.io/baguspy/pen/dyROKBj",
    "url": "https://codepen.io/baguspy/full/dyROKBj",
    "thumbnail": {
      "src": "/image/projects/freecodecamp-responsive-web-design/gusdur-tribute-page.png",
      "caption": "Preview of Gusdur Tribute Page - Freecodecamp",
      "original": true
    },
    "previews": [
      {
        "preview": "/image/projects/freecodecamp-responsive-web-design/gusdur-tribute-page.png",
        "caption": "Preview of Gusdur Tribute Page - Freecodecamp"
      }
    ],
    "details": {
      "about": {
        "indonesia": [
          "Proyek ini merupakan proyek mini yang dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org. Membuat sebuah halaman penghormatan tentang salah satu tokoh penting Indonesia, yaitu Bapak Pluralisme Indonesia, Abdurrahman Wahid yang responsif dengan HTML dan CSS. Ini merupakan proyek kedua dari lima proyek yang harus diselesaikan pada kursus Responsive Web Design yang diadakan oleh freeCodeCamp."
        ],
        "english": [
          "This project is a mini project created to complete the Responsive Web Design course provided by freecodecamp.org. Creating a tribute page dedicated to one of Indonesia's important figures, the Father of Indonesian Pluralism, Abdurrahman Wahid, that is responsive with HTML and CSS. This is the second of five projects to be completed in the Responsive Web Design course provided by freeCodeCamp."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Bahasa markup standar untuk menyusun halaman web"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Bahasa lembar gaya untuk mendesain halaman web"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Penyunting kode di dalam kursus freecodecamp.org"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform untuk menyunting kode secara langsung dan memamerkan hasilnya"
          }
        ],
        "english": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Standard markup language for structuring web page"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Stylesheet language for designing web pages"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Code editor within the freecodecamp.org course"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform to edit code directly and showcase the result"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang sebuah halaman penghormatan untuk situs web dan menjamin tampilan halaman yang responsif di berbagai perangkat."
            ],
            "english": [
              "Designed a tribute page for the website and ensured responsiveness on various devices."
            ]
          }
        }
      ]
    },
    "miniProject": true,
    "lastUpdated": "2024-11-10",
    "license": "MIT"
  },
  {
    "id": 11,
    "name": "Technical Documentation Page - Responsive Web Design Project (freecodecamp)",
    "category": "Front-end Development",
    "description": {
      "indonesia": "Sebuah halaman dokumentasi teknis yang menjelaskan materi dasar-dasar bahasa pemrograman PHP dasar. Dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org menggunakan HTML & CSS.",
      "english": "A technical documentation page explaining basic PHP programming language fundamentals. Created to complete the Responsive Web Design course provided by freecodecamp.org using HTML & CSS."
    },
    "technology": ["HTML", "CSS", "Responsive Web"],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Front-end Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://codepen.io/baguspy/pen/rNXoVOj",
    "url": "https://codepen.io/baguspy/full/rNXoVOj",
    "thumbnail": {
      "src": "/image/projects/freecodecamp-responsive-web-design/php-technical-documentation-page.png",
      "caption": "Preview of PHP Technical Documentation Page - Freecodecamp",
      "original": true
    },
    "previews": [
      {
        "preview": "/image/projects/freecodecamp-responsive-web-design/php-technical-documentation-page.png",
        "caption": "Preview of PHP Technical Documentation Page - Freecodecamp"
      }
    ],
    "details": {
      "about": {
        "indonesia": [
          "Proyek ini merupakan proyek mini yang dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org. Membuat sebuah halaman dokumentasi teknis mengenai dasar-dasar bahasa pemrograman PHP dengan HTML dan CSS yang responsif. Ini merupakan proyek ketiga dari lima proyek yang harus diselesaikan pada kursus Responsive Web Design yang diadakan oleh freeCodeCamp. Tipografi yang digunakan pada situs web ini adalah Fira Sans & Fira Mono dari Google Fonts."
        ],
        "english": [
          "This project is a mini project created to complete the Responsive Web Design course provided by freecodecamp.org. Creating a responsive technical documentation page regarding the fundamentals of the PHP programming language with HTML and CSS. This is the third of five projects to be completed in the Responsive Web Design course provided by freeCodeCamp. The typography used on this website is Fira Sans & Fira Mono from Google Fonts."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Bahasa markup standar untuk menyusun halaman web"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Bahasa lembar gaya untuk mendesain halaman web"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Penyunting kode di dalam kursus freecodecamp.org"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform untuk menyunting kode secara langsung dan memamerkan hasilnya"
          }
        ],
        "english": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Standard markup language for structuring web page"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Stylesheet language for designing web pages"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Code editor within the freecodecamp.org course"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform to edit code directly and showcase the result"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang sebuah situs web halaman dokumentasi teknis dan menjamin tampilan halaman yang responsif di berbagai perangkat."
            ],
            "english": [
              "Designed a technical documentation page website and ensured responsiveness on various devices."
            ]
          }
        }
      ]
    },
    "miniProject": true,
    "lastUpdated": "2024-11-10",
    "license": "MIT"
  },
  {
    "id": 12,
    "name": "Product Landing Page - Responsive Web Design Project (freecodecamp)",
    "category": "Front-end Development",
    "description": {
      "indonesia": "Sebuah halaman landas atau halaman utama produk headphone Fantech ALTO 7.1 HG26. Dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org menggunakan HTML & CSS.",
      "english": "A product landing page of Fantech ALTO 7.1 HG26 headphone. Created to complete the Responsive Web Design course provided by freecodecamp.org using HTML & CSS."
    },
    "technology": ["HTML", "CSS", "Responsive Web"],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Front-end Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://codepen.io/baguspy/pen/BaXZJJN",
    "url": "https://codepen.io/baguspy/full/BaXZJJN",
    "thumbnail": {
      "src": "/image/projects/freecodecamp-responsive-web-design/fantech-product-landing-page.png",
      "caption": "Preview of Fantech Product Landing Page - Freecodecamp",
      "original": true
    },
    "previews": [
      {
        "preview": "/image/projects/freecodecamp-responsive-web-design/fantech-product-landing-page.png",
        "caption": "Preview of Fantech Product Landing Page - Freecodecamp"
      }
    ],
    "details": {
      "about": {
        "indonesia": [
          "Proyek ini merupakan proyek mini yang dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org. Membuat sebuah halaman landas produk headphone ALTO 7.1 HG26 dari merek Fantech dengan HTML dan CSS yang responsif. Ini merupakan proyek keempat dari lima proyek yang harus diselesaikan pada kursus Responsive Web Design yang diadakan oleh freeCodeCamp. Tipografi yang digunakan adalah DM Sans, sedangkan ikon diambil dari Material Symbols & Icons Google Fonts. Proyek ini semata-mata untuk tujuan edukasi dan bukan merupakan bentuk promosi untuk Fantech. Seluruh logo dan merek dagang yang digunakan adalah milik Fantech, sementara kode dan desain halaman ini adalah hak cipta Bagus Perdana Yusuf."
        ],
        "english": [
          "This project is a mini project created to complete the Responsive Web Design course provided by freecodecamp.org. Creating a responsive product landing page of ALTO 7.1 HG26 headphones from Fantech brand with HTML and CSS. This is the fourth of five projects to be completed in the Responsive Web Design course provided by freeCodeCamp. The typography used is DM Sans, and the icons are sourced from Material Symbols & Icons by Google Fonts. This project is for educational purposes only and is not intended as a promotion for Fantech. All logos and trademarks belong to Fantech, while the code and design of this page are copyrighted by Bagus Perdana Yusuf."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Bahasa markup standar untuk menyusun halaman web"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Bahasa lembar gaya untuk mendesain halaman web"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Penyunting kode di dalam kursus freecodecamp.org"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform untuk menyunting kode secara langsung dan memamerkan hasilnya"
          }
        ],
        "english": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Standard markup language for structuring web page"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Stylesheet language for designing web pages"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Code editor within the freecodecamp.org course"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform to edit code directly and showcase the result"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang sebuah halaman landas suatu produk dan menjamin tampilan halaman yang responsif di berbagai perangkat."
            ],
            "english": [
              "Designed a product landing page and ensured responsiveness across devices."
            ]
          }
        }
      ]
    },
    "miniProject": true,
    "lastUpdated": "2024-11-10",
    "license": "MIT"
  },
  {
    "id": 13,
    "name": "Personal Portofolio Webpage - Responsive Web Design Project (freecodecamp)",
    "category": "Front-end Development",
    "description": {
      "indonesia": "Sebuah halaman web portofolio pribadi yang dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org menggunakan HTML & CSS.",
      "english": "A personal portfolio webpage created to complete the Responsive Web Design course provided by freecodecamp.org using HTML & CSS."
    },
    "technology": ["HTML", "CSS", "Responsive Web"],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Front-end Developer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://codepen.io/baguspy/pen/ExqGmzR",
    "url": "https://codepen.io/baguspy/full/ExqGmzR",
    "thumbnail": {
      "src": "/image/projects/freecodecamp-responsive-web-design/personal-portfolio-page.png",
      "caption": "Preview of Personal Portfolio - Freecodecamp",
      "original": true
    },
    "previews": [
      {
        "preview": "/image/projects/freecodecamp-responsive-web-design/personal-portfolio-page.png",
        "caption": "Preview of Personal Portfolio - Freecodecamp"
      }
    ],
    "details": {
      "about": {
        "indonesia": [
          "Proyek ini merupakan proyek mini yang dibuat untuk menyelesaikan kursus Responsive Web Design yang disediakan oleh freecodecamp.org. Membuat sebuah halaman web responsif tentang portofolio pribadi saya dengan HTML dan CSS. Ini merupakan proyek kelima dari lima proyek yang harus diselesaikan pada kursus Responsive Web Design yang diadakan oleh freeCodeCamp. Tipografi yang digunakan adalah DM Sans dari Google Fonts. Berisi ringkasan saya, pengalaman bekerja, riwayat pendidikan, dan proyek yang telah dikerjakan. Namun tidak selengkap halaman ini."
        ],
        "english": [
          "This project is a mini project created to complete the Responsive Web Design course provided by freecodecamp.org. Creating a responsive web page of my personal portfolio with HTML and CSS. This is the fifth of five projects to be completed in the Responsive Web Design course provided by freeCodeCamp. The typography used is DM Sans from Google Fonts. This page contains my summary, work experience, education history, and completed projects. although not as detailed as this page."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Bahasa markup standar untuk menyusun halaman web"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Bahasa lembar gaya untuk mendesain halaman web"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Penyunting kode di dalam kursus freecodecamp.org"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform untuk menyunting kode secara langsung dan memamerkan hasilnya"
          }
        ],
        "english": [
          {
            "name": "HyperText Markup Language (HTML)",
            "url": "https://html.spec.whatwg.org/multipage/",
            "version": "-",
            "usage": "Standard markup language for structuring web page"
          },
          {
            "name": "Cascading Style Sheet (CSS)",
            "url": "https://www.w3.org/Style/CSS/Overview.en.html",
            "version": "-",
            "usage": "Stylesheet language for designing web pages"
          },
          {
            "name": "Monaco Editor (probably)",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Code editor within the freecodecamp.org course"
          },
          {
            "name": "Codepen",
            "url": "https://microsoft.github.io/monaco-editor/",
            "version": "-",
            "usage": "Platform to edit code directly and showcase the result"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Merancang sebuah halaman web portofolio pribadi dan menjamin tampilan halaman yang responsif di berbagai perangkat."
            ],
            "english": [
              "Designed a personal portfolio webpage and ensure responsive page display across multiple devices."
            ]
          }
        }
      ]
    },
    "miniProject": true,
    "lastUpdated": "2024-12-10",
    "license": "MIT"
  },
  {
    "id": 14,
    "name": "Content Management UI & UX Design",
    "category": "UI & UX Design",
    "description": {
      "indonesia": "Desain antarmuka pengguna (UI) dan pengalaman pengguna (UX) untuk Aplikasi Web Manajemen Konten menggunakan Figma.",
      "english": "The UI and UX design for Content Management Web App were created using Figma."
    },
    "technology": ["User Interface", "User Experience", "Figma"],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "UI & UX Designer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "",
    "url": "",
    "thumbnail": {
      "src": "/image/projects/ui-ux-cmwa/preview-homepage-ui.png",
      "caption": "Homepage of UI & UX Design",
      "original": true
    },
    "previews": null,
    "details": {
      "about": {
        "indonesia": [
          "Desain antarmuka pengguna dan pengalaman pengguna ini dirancang untuk aplikasi manajemen konten berbasis web menggunakan perangkat lunak Figma. Desain tersebut mencakup versi web dan seluler. Proses perancangan meliputi diskusi dengan klien untuk mengembangkan peta pikiran, peta perjalanan pengguna, alur pengguna, dan peta situs. Setelah memperoleh umpan balik dan melakukan revisi yang diperlukan, proses dilanjutkan dengan pembuatan sistem desain, termasuk skema warna, tipografi, gaya kisi, dan komponen antarmuka. Tahap berikutnya adalah membuat kerangka desain, maket, dan purwarupa sesuai dengan spesifikasi klien.",
          "Pada perancangan desain ini, pemilihan tipografi melingkupi Poppins dan Inter yang tersedia pada Google Fonts, sedangkan ikon-ikon yang digunakan berasal dari Line Awesome dan Boxicons. Adapun halaman-halaman yang dirancang meliputi: halaman beranda, halaman proyek dan jadwal, halaman type proyek, detil proyek, daftar permintaan, gallery dan penjelajahan konten, kategory, artis, detil artis, detil video, halaman registrasi, halaman masuk, formulir permintaan konten, dan daftar model ai.",
          "Dengan hormat, fitur pratinjau Figma tidak dapat diakses dikarenakan dokumen tersebut memuat informasi rahasia milik klien."
        ],
        "english": [
          "This user interface (UI) and user experience (UX) design was designed for a web-based content management application using Figma software. The design includes both web and mobile versions. The design process included discussions with the client to create mind maps, user journey maps, user flows and sitemaps. After obtaining feedback and making necessary revisions, the process continued with the creation of the design system, including the color scheme, typography, grid style, and interface components. The following stage is to produce wireframes, mockups, and prototypes based on the client's requirements.",
          "In this design, the selected fonts are Poppins and Inter from Google Fonts, and the icons used are from Line Awesome and Boxicons. The designed pages include: homepage, project and schedule page, project type page, project details, request list, gallery and content exploring, category, artist, artist details, video details, registration page, login page, content request form, and AI model list.",
          "With respect, Figma's preview feature is not accessible as the document contains confidential client information."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Figma",
            "url": "https://www.figma.com/",
            "version": "Latest",
            "usage": "Perangkat lunak desain berbasis web untuk membuat antarmuka pengguna (UI) dan pengalaman pengguna (UX)"
          },
          {
            "name": "Whimsical",
            "url": "https://whimsical.com/",
            "version": "Latest",
            "usage": "Alat desain untuk membuat peta pikiran"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.0.8+",
            "usage": "Ikon sebagai elemen hiasan dalam desain laman web"
          },
          {
            "name": "Line Awesome",
            "url": "https://icons8.com/line-awesome",
            "version": "1.0.2+",
            "usage": "Icon pack untuk situs web"
          },
          {
            "name": "Unsplash",
            "url": "https://unsplash.com/",
            "version": "-",
            "usage": "Tempat mencari gambar gratis"
          },
          {
            "name": "Google Font",
            "url": "https://fonts.google.com/",
            "version": "-",
            "usage": "Sumber terbuka untuk tipografi dan Ikon dari Google"
          },
          {
            "name": "Color Hexa",
            "url": "https://www.colorhexa.com/",
            "version": "Latest",
            "usage": "Alat untuk membangkitkan palet warna"
          }
        ],
        "english": [
          {
            "name": "Figma",
            "url": "https://www.figma.com/",
            "version": "Latest",
            "usage": "Web-based design software for creation of user interface (UI) and user experience (UX)"
          },
          {
            "name": "Whimsical",
            "url": "https://whimsical.com/",
            "version": "Latest",
            "usage": "Design tool to make mindmap"
          },
          {
            "name": "Boxicons",
            "url": "https://boxicons.com/",
            "version": "2.0.8+",
            "usage": "Icons as ornamental elements in webpage design"
          },
          {
            "name": "Line Awesome",
            "url": "https://icons8.com/line-awesome",
            "version": "1.0.2+",
            "usage": "The icon pack for website"
          },
          {
            "name": "Unsplash",
            "url": "https://unsplash.com/",
            "version": "-",
            "usage": "A place to discover free images"
          },
          {
            "name": "Google Font",
            "url": "https://fonts.google.com/",
            "version": "-",
            "usage": "Open source for typography and Icons from Google"
          },
          {
            "name": "Color Hexa",
            "url": "https://www.colorhexa.com/",
            "version": "Latest",
            "usage": "Tools to generate a color palette"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Membuat mind map menggunakan Whimsical untuk mengorganisasikan gagasan secara terstruktur dengan perencanaan dan spesifikasi secara terperinci.",
              "Menyusun peta perjalanan pengguna menggunakan Figma Jam untuk memetakan langkah-langkah interaksi pengguna dengan produk, guna mengidentifikasi pain points dan meningkatkan pengalaman pengguna yang lebih baik, intuitif, dan efisien sehingga mencapai tujuan yang diinginkan.",
              "Membuat alur pengguna dengan Figma Jam untuk memahami jalur interaksi yang dilalui pengguna, mengidentifikasi titik masalah, serta mengoptimalkan efisiensi desain guna menciptakan pengalaman pengguna yang logis, intuitif, dan mudah dipahami.",
              "Membuat peta situs dengan Figma Jam untuk merancang struktur situs web yang intuitif dan mudah dinavigasi, sehingga meningkatkan pengalaman pengguna dan mengurangi potensi frustrasi akibat navigasi yang rumit.",
              "Mendesain antarmuka pengguna (UI) dan pengalaman pengguna (UX) untuk aplikasi web dan mobile dengan memanfaatkan Figma guna menciptakan desain yang responsif, intuitif, dan menarik.",
              "Merancang sistem desain modular yang mencakup elemen penting seperti skema warna, tipografi dengan ukuran yang bervariasi, dan komponen yang diperlukan guna menciptakan konsistensi desain di seluruh produk. Mendesain kerangka kerja desain, malet, dan purwarupa untuk mengomunikasikan konsep desain secara jelas dan efektif."
            ],
            "english": [
              "Created mind maps using Whimsical to systematically organize ideas, incorporating detailed planning and specifications.",
              "Crafted a user journey map using Figma Jam to outline the steps of user interaction with the product, aiming to identify pain points and enhance the user experience to be more intuitive, efficient, and aligned with the desired goals.",
              "Created user flow diagrams using Figma Jam to comprehend user interaction pathways, identify pain points, and enhance design efficiency, resulting in a logical, intuitive, and user-friendly experience.",
              "Created a sitemap using Figma Jam to design an intuitive and easy-to-navigate website structure, thereby enhancing user experience and minimizing potential frustration caused by complex navigation.",
              "Designed user interfaces (UI) and user experiences (UX) for web and mobile applications using Figma, resulting in responsive, intuitive, and engaging designs.",
              "Devised a modular design system encompassing essential elements like color schemes, typography of various sizes, and crucial components to ensure design consistency across products. Designed wireframes, mockups, and prototypes to effectively communicate design concepts."
            ]
          }
        }
      ]
    },
    "miniProject": false,
    "lastUpdated": "2024-01-31",
    "license": ""
  },
  {
    "id": 15,
    "name": "Mean Variance Standard Deviation Calculator - Data Analysis With Python (freeCodeCamp)",
    "category": "Data Analysis",
    "description": {
      "indonesia": "Sebuah program kalkulator sederhana dikembangkan menggunakan bahasa pemrograman Python dan pustaka Numpy untuk menghitung rata-rata, varians, dan simpangan baku guna menyelesaikan kursus Data Analysis with Python yang disediakan oleh freecodecamp.org.",
      "english": "A simple calculator program was developed using the Python programming language and the Numpy library to calculate the mean, variance, and standard deviation to complete the Data Analysis with Python course provided by freecodecamp.org."
    },
    "technology": ["Python", "Numpy"],
    "contributors": [
      {
        "name": "Bagus Perdana Yusuf",
        "role": "Programmer",
        "profile": "https://www.linkedin.com/in/bagus-perdana-yusuf-0310971a5/",
        "avatar": "/image/avatar/baguspy.png"
      }
    ],
    "source": "https://github.com/bagusperdanay7/fcc-DA-Mean-Variance-Standard-Deviation-Calculator",
    "url": "https://replit.com/@baguspyus/Mean-Variance-Standard-Deviation-Calculator",
    "thumbnail": {
      "src": "/image/projects/data-analysis-with-python/mean-std-variance-calculator.jpg",
      "caption": "Illustration of Mean, Standard Deviation & Variance Calculator Project",
      "original": false
    },
    "previews": null,
    "details": {
      "about": {
        "indonesia": [
          "Proyek ini merupakan program sederhana analisis data menggunakan Python dan Numpy, yang mengimplementasikan pembuatan kalkulator untuk menghitung rata-rata, varians, dan simpangan baku. Proyek ini merupakan proyek pertama dari lima proyek yang harus diselesaikan dalam kursus Analisis Data dengan Python yang diselenggarakan oleh freecodecamp.org."
        ],
        "english": [
          "This project is a simple data analysis program using Python and Numpy, implementing the creation of a calculator to calculate mean, variance, and standard deviation. This project is the first of five projects to be completed in the Data Analysis with Python course organized by freecodecamp.org."
        ]
      },
      "tools": {
        "indonesia": [
          {
            "name": "Python",
            "url": "https://www.python.org/",
            "version": "3.10.1+",
            "usage": "Bahasa pemrograman utama"
          },
          {
            "name": "Numpy",
            "url": "https://numpy.org/",
            "version": "2.1.2+",
            "usage": "Pustaka Python untuk membantu melakukan komputasi ilmiah"
          },
          {
            "name": "Poetry",
            "url": "https://python-poetry.org/",
            "version": "1.5.5+",
            "usage": "Pengelola dependensi untuk Python"
          },
          {
            "name": "Replit",
            "url": "https://replit.com/",
            "version": "Latest",
            "usage": "Platform berbasis web untuk membuat program"
          }
        ],
        "english": [
          {
            "name": "Python",
            "url": "https://www.python.org/",
            "version": "3.10.1+",
            "usage": "Main programming language"
          },
          {
            "name": "Numpy",
            "url": "https://numpy.org/",
            "version": "2.1.2+",
            "usage": "Python library to help perform scientific computing"
          },
          {
            "name": "Poetry",
            "url": "https://python-poetry.org/",
            "version": "1.5.5+",
            "usage": "Dependency manager for Python"
          },
          {
            "name": "Replit",
            "url": "https://replit.com/",
            "version": "Latest",
            "usage": "Web-based platform to create program"
          }
        ]
      },
      "responsibilities": [
        {
          "name": "Bagus Perdana Yusuf",
          "detail": {
            "indonesia": [
              "Membuat kalkulator sederhana menggunakan Python dan pustaka Numpy guna menghitung rata-rata, varians, dan simpangan baku, serta memperbaiki bug yang ditemui selama pembuatan program"
            ],
            "english": [
              "Created a basic calculator with Python and Numpy to calculate the mean, variance, and standard deviation, and fix any bugs that appear during the development phase."
            ]
          }
        }
      ]
    },
    "miniProject": true,
    "lastUpdated": "2024-10-19",
    "license": "MIT"
  }
]
